[
  {
    "author": "Simon Zerafa",
    "avatar": "722c3bb0d5b36746c6ddaa540cf722fe",
    "date": "2007-10-24T00:57:45.000Z",
    "content": "Hi,\r\n\r\nFrom the 6.2.6.C update FAQ:\r\n\r\n<blockquote>If your Home Hub hasn’t yet been upgraded after one month, the following advice will help you to receive the upgrade as quickly as possible:\r\n\r\n    * Leave your Hub switched-on, including at night\r\n    * If you have set up the DMZ / 'Assign public IP address to Hub' feature in the Games &amp; Application Sharing section of the Hub Manager, your Home Hub will not be automatically upgraded. To receive an upgrade, disable the feature and leave your Hub switched on. The feature can be re-enabled after the Home Hub has been upgraded.\r\n\r\nYour BT Home Hub should then be upgraded within the next 7 days.</blockquote>\r\n\r\nHow many users will not realise that their hub will never be updated because they have the 'Assign public IP address to Hub' feature enabled?\r\n\r\nKind Regards\r\n\r\nSimon"
  },
  {
    "author": "Adrian Pastor",
    "avatar": "ef14ae4ef69235fa6c3709438357819d",
    "date": "2007-10-24T15:58:03.000Z",
    "content": "Hey Simon!\r\n\r\nThat's a VERY interesting point. Funny enough, my Home Hub's firmware hasn't been automatically updated yet (been waiting for a couple of daysalready). Perhaps this is because I've customized the config file way too much?"
  },
  {
    "author": "jarviser",
    "avatar": "b568f537f3ffedd48497de8258f6d243",
    "date": "2007-10-25T09:09:38.000Z",
    "content": "I have purposely taken all my stealthing out by a full reset and I am still waiting after 2 weeks. BT say it can take up to another 6 weeks. and refuse to let me have a forced upgrade site address like they had with 6.2.2.6  Our little homehub forum is still trying to work out whether 6.2.6.C is a fix for the disastrous B version that reboots continually, or if B is for FON and C is for non-FON."
  },
  {
    "author": "jarviser",
    "avatar": "b568f537f3ffedd48497de8258f6d243",
    "date": "2007-10-25T09:12:44.000Z",
    "content": "by the way, Remote Assistance is disabled on my 6.2.2.6 in the first 30 minutes after a reset by an automatic mini-update, so the largest security hole is plugged without waiting for the upgrade which seems to be more about FON."
  },
  {
    "author": "Adrian Pastor",
    "avatar": "ef14ae4ef69235fa6c3709438357819d",
    "date": "2007-10-25T09:53:37.000Z",
    "content": "Once my firmware is updated to the latest version I'll research if there is another way to get remote access through exploitation. There must be another way.\r\n\r\nI mean, the router natively supports remote services. All these changes appear to be done on BT 's \"flavour\" of the router as opossed to Thomson's."
  },
  {
    "author": "Adam",
    "avatar": "de65c489925e50d42453468836e7c21b",
    "date": "2007-11-01T13:44:03.000Z",
    "content": "Just so you know one reason for 6.2.6.C is to help fix the NAT from constantly changing to closed or moderate even when its set to be open. This helps with online gaming e.g. Xbox live. Not sure what else it fixes though :)"
  }
]