[
  {
    "author": "Awesome AnDrEw",
    "avatar": "5e0f595cbc8f1811233adce10ac6c5d3",
    "date": "2008-04-14T13:15:07.000Z",
    "content": "Pretty interesting post, Adrian. Cryptography and encryption schemes are not my strong point, but I would imagine this took a lot of work, and is quite impressive."
  },
  {
    "author": "Steve",
    "avatar": "7900a7c7a83f32c569fab55cfa7b424a",
    "date": "2008-04-14T15:15:05.000Z",
    "content": "I never fail to be amazed by the fact companies are willing to ship to millions of customers routers which have WEP rather than WPA by default, but it is even more astonishing that the default key (which lets face it most people will never change, knowing nothing about computer security) can be derived from the default SSID (which is public knowledge)!\r\n\r\nGood work guys on continuing to keep the pressure on BT and other companies to wise up. I mean how hard can it be for them?"
  },
  {
    "author": "Jonas",
    "avatar": "c970dee63fb8c2f40d17e04454742964",
    "date": "2008-04-14T15:39:57.000Z",
    "content": "As always, a high quality post. Thank you very much for this information and thank you kevin for making this possible ;)"
  },
  {
    "author": "david",
    "avatar": "c1fe74403e1edfc1a3465a23874373e2",
    "date": "2008-04-15T05:43:52.000Z",
    "content": "This information is dynamite, and brings to mind the info posted on http://www.rfidupdate.com/articles/index.php?id=1563&amp;from=rss where rfids can be cloned, this is the basis of the UK Goverment ID cards!"
  },
  {
    "author": "Adrian 'pagvac' Pastor",
    "avatar": "ef14ae4ef69235fa6c3709438357819d",
    "date": "2008-04-15T07:29:38.000Z",
    "content": "Thanks a lot for your feedback guys. As you know we never hide anything at GNUCITIZEN. We truly believe this benefits everyone (including consumers) in the long run. And of course, thank you Kevin: this project wouldn't have been possible without your help!\r\n\r\nStay tuned for HITB Dubai 2008!"
  },
  {
    "author": "Sasank Borua",
    "avatar": "4e10859082f7c65cb37600032ef54733",
    "date": "2008-04-15T08:54:48.000Z",
    "content": "Good Job! I tried with bot my new and old hub....Works perfectly!"
  },
  {
    "author": "Edward Pearson",
    "avatar": "9fb0dccdb63d79f445b757928a33fdc4",
    "date": "2008-04-15T11:32:18.000Z",
    "content": "Great article. I just tried this at home (several of my neighbours appear to have Home Hubs), and it works perfectly.\r\n\r\nI might buy a BT Home Hub 1.5, see if I can't beat you to the plate next time ;)"
  },
  {
    "author": "Simon",
    "avatar": "62435b20a027dad7e1c37279fb20bf0d",
    "date": "2008-04-15T12:55:35.000Z",
    "content": "This works for my SpeedTouch!! I just checked it. My question is: I use an 128bit key, generated by my SpeedTouch. Can this be found out as well?\r\n\r\nSorry for my English."
  },
  {
    "author": "Mark",
    "avatar": "814aaca7f2ffb892b4694cca7fb6dc09",
    "date": "2008-04-15T19:28:00.000Z",
    "content": "Thanks very much, Ill continue evangelising WPA and non trivial passwords."
  },
  {
    "author": "Adrian 'pagvac' Pastor",
    "avatar": "ef14ae4ef69235fa6c3709438357819d",
    "date": "2008-04-16T19:45:48.000Z",
    "content": "Wohoo, you guys have been getting very good results with this attack! As you can see it works quite wonderfully!\r\n\r\nbtw, I'm releasing BTHHkeygen with the rainbow tables tomorrow at HITB Dubai 2008: http://conference.hackinthebox.org/hitbsecconf2008dubai/?page_id=186\r\n\r\nUsing such tool you'll be able to generate the (about 80) possible keys for the BT Home Hub instantly, thus saving bruteforcing time. BTHHkeybf which allows you to identify the valid key *will* also be released with the rest of my presentation materials.\r\n\r\nAdditionally, I will also release \"axis-defacer\": a PoC tool to demo video stream replacement attacks (hijacking surveillance video) for Axis IP cameras."
  },
  {
    "author": "Hubert Seiwert",
    "avatar": "375c0284a6efd8899f2bc69dbf99d6e3",
    "date": "2008-04-17T15:00:48.000Z",
    "content": "I have ported Kevin Devine's stkeys.c to Python if anyone's interested. My script uses Python 2.5's hashlib for sha1. It's a lot shorter than the C version."
  },
  {
    "author": "Simon",
    "avatar": "62435b20a027dad7e1c37279fb20bf0d",
    "date": "2008-04-17T15:34:18.000Z",
    "content": "Hey, I just found out the 128bit-key in my router wasn't generated by my speedtouch.. Only the first characters are the ones from the 64bit key\r\n\r\nGreat tool, thanks!!"
  },
  {
    "author": "Marchiner",
    "avatar": "564e44b6b33cc73b9bb444ea8f22694c",
    "date": "2008-04-18T15:19:45.000Z",
    "content": "Adrian Pastor, \r\n  \r\n Again.. wonderful post!!!!\r\n\r\nI am finishing a (how-to - step by step-)  secure your wireless networks... \r\n\r\nUsing firewalls, Vpns, TKIP, corrects cryptos like WPA2, wireless IPS, fakeaps,  and more...\r\n\r\nThis new kind of atack will be mentioned inside the how-to with all author´s credits!\r\n \r\nThx to gnucitizen and other independent research's! \r\n\r\nIt will be available soon!\r\n-If possible i will post something here."
  },
  {
    "author": "Adrian 'pagvac' Pastor",
    "avatar": "ef14ae4ef69235fa6c3709438357819d",
    "date": "2008-04-19T12:16:41.000Z",
    "content": "@Marchiner: please let us know when you publish such article. It sounds interesting!\r\n\r\n@Simon: if the key is the default one, then it's quite likely that it will work. The vulnerability has nothing to do with the encryption type or strength, but rather with the fact that they key value is predictable. Your best bet is to simply try out the attack.\r\n\r\n@Hubert: that sounds really cool. Can you please post the link to the python port please?"
  },
  {
    "author": "Def 69",
    "avatar": "cb9ced4c0cc17f5fcb1ba0b552b955a5",
    "date": "2008-04-21T16:36:35.000Z",
    "content": "Hi dudes!\r\n I hope it will help u!\r\n\r\nhttp://weiss.u40.hosting.digiweb.ie/stech/\r\n\r\nAnd this is KeyGen for SpeedTouch THOMSON!\r\nhttp://www.mediafire.com/?svyenmddzm3\r\n\r\nSee u dudes! 8)\r\n\r\nDef 69"
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2008-04-21T19:49:40.000Z",
    "content": "thanks for the heads-up"
  },
  {
    "author": "Hubert Seiwert",
    "avatar": "375c0284a6efd8899f2bc69dbf99d6e3",
    "date": "2008-04-22T00:45:32.000Z",
    "content": "Kevin has added my ssid2key.py Python script to http://weiss.u40.hosting.digiweb.ie/stech/stkeys.zip"
  },
  {
    "author": "Edward Pearson",
    "avatar": "9fb0dccdb63d79f445b757928a33fdc4",
    "date": "2008-04-22T19:32:18.000Z",
    "content": "For the script kiddie in all of us, I've created a Windows XP version of \"BTHHkeybf\".\r\n\r\nIn the name of responsible disclosure, I'll release it after Adrian has done his talk and makes his code available."
  },
  {
    "author": "Adrian 'pagvac' Pastor",
    "avatar": "ef14ae4ef69235fa6c3709438357819d",
    "date": "2008-04-22T21:17:01.000Z",
    "content": "BTHHkeygen (including rainbow tables) and BTHHkeybf can be found here: http://conference.hitb.org/hitbsecconf2008dubai/materials/D2T1%20-%20Adrian%20Pastor%20-%20Cracking%20Into%20Embeded%20Devices%20and%20Beyond.zip\r\n\r\n(located on the \"\\BT Home Hub\\demo_exploits\\Default WEP key cracking\\\" folder)\r\n\r\n@Edward: you can now go ahead and post a link to your WinXP port :) Thanks for waiting for our release first.\r\n\r\n@Hubert: thanks for letting us know!"
  },
  {
    "author": "DecereBrain",
    "avatar": "cba1b51f32d41861aa8bca46114dea0f",
    "date": "2008-04-23T01:47:11.000Z",
    "content": "hahaha, that’s a good work :).\r\n\r\nA similar algorihtm exist for the generation of the defaut WEP key in the Hitachi AH4021 and AH4222, used in France by Club-Internet and Alice.\r\n\r\nIn fact, the default WEP key is the beginning of the SHA-1 hash of the default SSID, which is derived from the serial number of the device (which is derived form the MAC address of the Wi-Fi interface).\r\n\r\nWe went on that conclusion thanks to the marvelous work of Club-Internet, who just released a Windows GUI tool named WEPtool. WEPtool takes a Club-Internet.box SSID and generate the corresponding WEP key (yes, our #@! government vote for fascit laws against the citizens while ISP help wardrivers and outlaws). What is really fun is that we did not need to perform any sort of reverse engineering to understand the generation process : the WEPtool relies entirely upon a DDL called FSHash (for File String Hash), and the source code of that library is open source !\r\n\r\nWhat you need is a SHA-1 computing program, and you can hack into any of these.\r\n\r\nThe WEPtool binary and the source code of the FSHash DLL can be found on my humble website). A reverse engineering work has been made by a member of the FRET group, and all of this was originally published in the 2600 Lille meeting reports along the year 2007 and in this thread, thanks to my friend oxyde."
  },
  {
    "author": "Ricky \"Hexy\" Small",
    "avatar": "4d8b67be6eed5a71ba35e470827351dd",
    "date": "2008-04-23T14:41:03.000Z",
    "content": "Edward Pearson when will u be releasing your win32 version of BTHHKeygen n BF Thanks"
  },
  {
    "author": "Ruslan",
    "avatar": "0cf764260cc28ff0a66aa100e90e3eb5",
    "date": "2008-04-23T18:45:33.000Z",
    "content": "What are the CC, PP and XXX values? You lost me there..."
  },
  {
    "author": "Edward Pearson",
    "avatar": "9fb0dccdb63d79f445b757928a33fdc4",
    "date": "2008-04-24T08:41:18.000Z",
    "content": "@Ricky \"Hexy\" Small\r\n\r\nProbably when I get home tonight. Last night I forgot."
  },
  {
    "author": "Elfist",
    "avatar": "5879dc2cc8ac1f5cb8c18a4a8918b6c4",
    "date": "2008-04-24T15:37:02.000Z",
    "content": "Would be very interesting seeing the win32 version. Great job guys! BT Sucks!"
  },
  {
    "author": "Edward Pearson",
    "avatar": "9fb0dccdb63d79f445b757928a33fdc4",
    "date": "2008-04-27T09:39:39.000Z",
    "content": "Right. Sorry about the delay, I've had a very busy couple of days.\r\n\r\nAs requested, here is the Windows XP version of BTHHkeybf\r\n\r\nhttp://facecrook.net/BTHHkeybf.zip\r\n\r\nThis code isn't elegant, optimized, well written, or pretty, but it works well. It was 2am and I needed an Internet Connection, best practice wasn't an issue.\r\n\r\nThere's always a chance you'll have to make a few changes to the script (different network auth type perhaps, higher DCHP timeout maybe.)\r\n\r\nPlease feel free to do whatever you want with this, use it, edit it, distribute it.\r\n\r\nLook inside BTHHkeybf.vbs for additional help.\r\n\r\n(P.S. This probably won't work on Vista, for those interested, I suggest you investigate the built in \"netsh\" utility, by the looks of things it could be used as a drop in replacment for Engl's zwlancfg.exe.)"
  },
  {
    "author": "Elfist",
    "avatar": "5879dc2cc8ac1f5cb8c18a4a8918b6c4",
    "date": "2008-04-27T18:29:54.000Z",
    "content": "Cannot get this the win32 version to work. Anyone fancy making a guide or step by step? Cheers x"
  },
  {
    "author": "Edward Pearson",
    "avatar": "9fb0dccdb63d79f445b757928a33fdc4",
    "date": "2008-04-28T07:24:11.000Z",
    "content": "Elfist,\r\nOne step-by-step, coming up.\r\n\r\nFor this example, we're using BTHomeHub-CD07\r\n\r\nFirst use stkeys to generate a list of possible keys, use the -o option to output these to a file:\r\n\r\nstkeys -i CD07 -o keys.txt\r\n\r\nThen, in command prompt, run my script against this file, thus:\r\n\r\ncscript BTHHkeybf.vbs BTHomeHub-CD07 keys.txt\r\n\r\nProvided you're NOT connected to any wireless networks when you run it, and the Wireless Zero Config service is running and enabled, it'll crack the password."
  },
  {
    "author": "Elfist",
    "avatar": "5879dc2cc8ac1f5cb8c18a4a8918b6c4",
    "date": "2008-04-29T19:22:35.000Z",
    "content": "Lovely!\r\n\r\nBut abit of a problem. I know this isnt a support site or anything but i think alot of people would have the same problems as im having. So sorry if im annouying! I managed to output the keys file from the stkeys. Then I type cscript BTHHkeybf.vbs BTHomeHub-CD07 keys.txt and not alot happends... Is it meant to automatically connect to the network after i hit enter? or wait awhile until it finds the right key? And also it should be compatible with xp sp3? And in the outputted txt file are the 1st 10 digs 1 possible key? then the next 10 the next possible key etc etc? thanks again! x"
  },
  {
    "author": "Edward Pearson",
    "avatar": "9fb0dccdb63d79f445b757928a33fdc4",
    "date": "2008-04-29T22:30:23.000Z",
    "content": "I need more than \"not a lot happens\". What does it say when you run BTHHkeybf.vbs?\r\n\r\nYou need WZC enabled as I said before. You also need to replace BTHomeHub-CD07 with the SSID you're trying to crack.\r\n\r\nYes, the keys are what you used stkeys for. RTFA!!!"
  },
  {
    "author": "Elfist",
    "avatar": "5879dc2cc8ac1f5cb8c18a4a8918b6c4",
    "date": "2008-05-01T13:25:57.000Z",
    "content": "I was using the CD07 as an example ovi. WZC is enabled. When I run the BTHHkeybf.vbs its comes up with the Usuage and the the example (Example: cscript BTHHkeybf.vbs BTHomeHub-CD07.txt )in cmd but doesn't actually crack it or does anything."
  },
  {
    "author": "niteman",
    "avatar": "d96a99cc231f067a5b7024124b53d1bb",
    "date": "2008-05-02T13:58:33.000Z",
    "content": "Any progress on the windows version of bthhkeygen?"
  },
  {
    "author": "Slinx",
    "avatar": "f85cf22f0afcd4ee1dcec85df45fd3d9",
    "date": "2008-05-02T14:59:54.000Z",
    "content": "I have made a WinXP version. I will email it to anyone interested.\r\n\r\n-S"
  },
  {
    "author": "Edward Pearson",
    "avatar": "9fb0dccdb63d79f445b757928a33fdc4",
    "date": "2008-05-02T16:04:23.000Z",
    "content": "The win32 version is linked above...\r\n\r\nIt works perfectly for me, I can only assume Elfist is doing something wron."
  },
  {
    "author": "Edward Pearson",
    "avatar": "9fb0dccdb63d79f445b757928a33fdc4",
    "date": "2008-05-02T16:07:17.000Z",
    "content": "Oh sorry, you want the keygen.\r\n\r\nAdrian's precomputes the keys into a Rainbow table type configuration. This allows the lookups to be instant.\r\n\r\nYou can use the stkeys program detailed above if you don't care about the crypt speed (My Centrino does it in a matter of seconds)\r\n\r\nRTFA!!"
  },
  {
    "author": "Elfist",
    "avatar": "5879dc2cc8ac1f5cb8c18a4a8918b6c4",
    "date": "2008-05-04T12:05:59.000Z",
    "content": "Slinx whats your email?"
  },
  {
    "author": "Slinx",
    "avatar": "d71835387ec48081dea582f602720175",
    "date": "2008-05-04T21:48:25.000Z",
    "content": "<em>files.slinx</em> <strong>(at)</strong> <em>googlemail</em> <strong>[dot]</strong> <em>com</em>\r\n\r\n-S"
  },
  {
    "author": "NoName",
    "avatar": "f32fcdf896db95ba347a3602e9841dc1",
    "date": "2008-05-08T18:42:43.000Z",
    "content": "ive got a ps3 and there's a few bt home hubs around me is there any way to hack them \r\n\r\n\r\n\r\nthx for much if u can help\r\n\r\nplz email me the answer or post here"
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2008-05-08T20:24:30.000Z",
    "content": "there are many ways but you are on your own in this business :)"
  },
  {
    "author": "Edward Pearson",
    "avatar": "e96d247eb7e87eddf421c09e363e6de1",
    "date": "2008-05-09T08:42:21.000Z",
    "content": "For the third time: RTFA.\r\n\r\nIt's not exactly cryptic, it's practically a step by step."
  },
  {
    "author": "Adrian 'pagvac' Pastor",
    "avatar": "0367b81839d31a5fa3d7bea79ef71b9e",
    "date": "2008-05-10T11:20:38.000Z",
    "content": "It's funny, when someone is so focused on breaking into a computer network and not interested in the learning experience, he will fail to see how it can be done even when the information is right in front of his eyes!"
  },
  {
    "author": "Adrian 'pagvac' Pastor",
    "avatar": "0367b81839d31a5fa3d7bea79ef71b9e",
    "date": "2008-05-10T11:26:54.000Z",
    "content": "@Simon: this attack has only been tested with the factory-default keys used by Thomson Speedtouch/BTHH routers. In some cases (can depend on ISP) the default it's a WPA key, in others, it's a WEP key. \r\n\r\nIn the case of the BT Home Hub which is widely used in the UK, the default key is a a 40bits WEP key."
  },
  {
    "author": "noname",
    "avatar": "f32fcdf896db95ba347a3602e9841dc1",
    "date": "2008-05-10T12:59:01.000Z",
    "content": "thx for the info"
  },
  {
    "author": "Rob",
    "avatar": "85e25cb74cac01638066902b96817bc7",
    "date": "2008-05-15T18:06:25.000Z",
    "content": "Hi all.\n\nA very interesting article showing just how weak wep encryption is.  I thought i'd give it a go so I dug out my old homehub router.  I ran stkeys and outputted the txt file, i looked and checked my wep key was listed, which it was.  But when I came to run the BTHHkeybf.vbs file, i got the following message;\n\n<pre><code>Trying key: 1234567890\nC:\\BTHHkey.vbs(27,2) (null): This application failed to start because the application configuration is incorrect.  Reinstalling the application may fix this problem.</code></pre>\n\nAm I doing something blatently wrong or do I need to go in and change the script?\n\nregards\n\nRob."
  },
  {
    "author": "ellis goward",
    "avatar": "4bc92033eeeaf44ae6a2e13159550d83",
    "date": "2008-06-01T12:49:27.000Z",
    "content": "i wouuld ,ike to log on 2 my neighbours BT-HomeHub but the way this is set out is well confusing i just need the pass key \r\n\r\ncan some 1 please help me out with some step by step instructions or sumin   please!!!"
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2008-06-02T08:30:12.000Z",
    "content": "ellis, we don't like to moderate comments but please, don't post these kind of questions here. this is not a script-kiddish forum. many thanks."
  },
  {
    "author": "Stephen",
    "avatar": "7900a7c7a83f32c569fab55cfa7b424a",
    "date": "2008-06-02T17:54:56.000Z",
    "content": "The BT HH v1.5 uses this algorithm as well: I just tried it on mine - your article states that it uses a different algorithm: why did you say that?"
  },
  {
    "author": "noob",
    "avatar": "ef5e34c391e4bf0ad962221cbbe9f72e",
    "date": "2008-06-02T18:37:32.000Z",
    "content": "Nice work. So does BTHHkeybf.vbs only work for 40 bits WEP keys only?\r\n\r\nReason i ask is I used the step by step posted by Edward Pearson(many thanks)at which the keys generated does have my key in the list but the key found by BTHHkeybf.vbs is not correct.\r\n\r\nMy default is 64 bit wep."
  },
  {
    "author": "Stephen",
    "avatar": "7900a7c7a83f32c569fab55cfa7b424a",
    "date": "2008-06-02T21:54:12.000Z",
    "content": "Okay so I followed your method in the post and it seemed to work in that typing:\r\n\r\n<pre><code>echo -n '' | openssl sha1</code></pre>\r\n\r\nGives a hash which has the first 10 characters as the default WEP key and the last 4 characters as the suffix to the SSID.\r\n\r\nBut when I look at the entry in BTHH-Keys.csv from the zip archive of your conference presentation the correct key is not found in the row corresponding to the default SSID of my HH.  perhaps I have misunderstood what the files BTHH-Keys is for?"
  },
  {
    "author": "jimjamsunny",
    "avatar": "a6c287cd491b879cf5a28a836766511f",
    "date": "2008-06-03T11:24:15.000Z",
    "content": "Hi all... I'm confused.\r\n\r\nAre these tools only to generate the WEP/WPA keys or are they to find out what the SERIAL NUMBER of the router is?\r\n\r\nDepending on which is which would depend on how much of an impact this would have on BTs customers?\r\n\r\nThanks"
  },
  {
    "author": "Stephen",
    "avatar": "7900a7c7a83f32c569fab55cfa7b424a",
    "date": "2008-06-03T12:39:16.000Z",
    "content": "Just to clarify my response above: between the '' in the echo command should be the modifed serial number according to the method in the main post(i.e. with CC and PP removed and XXX changed to hex)."
  },
  {
    "author": "ginjon",
    "avatar": "c8becbd5b0879ac5f676a1fc906b8959",
    "date": "2008-06-06T12:23:23.000Z",
    "content": "i have tried all sorts of ways to access my pals home hub. i used the bthhkeygen and gathered the list of keys but thats as far as i got i dont understand the rest. where do i type commands i  it in the command prompt? if so i have tried several comands stated by this article and also some of the comands within the documentation attached with the software. as i have no understanding of how this works i fail to see how the home hub is vulnerable to attack the home hub is bthomehub-0CED and as a result of knowing jack about this subject i resorted to painstakingly  trying each key individually all 76. none of which worked will someone please help? is the status of the connection changed visually on my screen e.g. should (padlock) Security Enabled Wireless Network be changed so it tells me i am connected to the network. could someone possibly help and or either provide me with the key or how to obtain it. i am an ultimate beginner to the scene of security for my computer. mant thanks in advance 8)"
  },
  {
    "author": "ginjon",
    "avatar": "c8becbd5b0879ac5f676a1fc906b8959",
    "date": "2008-06-06T12:25:52.000Z",
    "content": "Oh and what is stkeys supposed to do? how the hell am i supposed to output my keys to a .txt file? HHHMMMMMMM"
  },
  {
    "author": "ellis goward",
    "avatar": "4bc92033eeeaf44ae6a2e13159550d83",
    "date": "2008-06-07T19:25:30.000Z",
    "content": "fair nuff m8 itz all kl  ;)"
  },
  {
    "author": "Stephen",
    "avatar": "7900a7c7a83f32c569fab55cfa7b424a",
    "date": "2008-06-08T00:08:10.000Z",
    "content": "Hi again\r\n\r\nJust took a look at the stkeys source code - I presume this is what you used to get your database of potential keys as included in conference presentation? If so the reason that my router's default key isn't in your database is that stkeys inly defaults to keys for units produced in '05 &amp; '06 - my unit is produced (from serial no.) in '07. So to cover v1.5 units (if my guess that this is the problem proves correct) you need to increase the upper limit in stkeys and thus enlarge the database.\r\n\r\nThanks again for the good work!"
  },
  {
    "author": "Rafik",
    "avatar": "5d2bd9e1ed3163e36f156c13cc1db51b",
    "date": "2008-06-08T21:48:18.000Z",
    "content": "Hi. I have a small problem. i have a bt hub, but its on my ex girlfriends adress, and i need to know what is she doing with it cos the last bills are inormess. i there any chance that someon would help me out with getting access to my bt home hub throu internet? and ofcourse getting acces to the devices sonnected to the hub ?"
  },
  {
    "author": "Adrian 'pagvac' Pastor",
    "avatar": "0367b81839d31a5fa3d7bea79ef71b9e",
    "date": "2008-06-15T09:38:59.000Z",
    "content": "@noob: 40 bits WEP encryption is usually advertised as 64 bits. They're both the same encryption type and strength.\n\n@jimjamsunny: the tools allow you to find the default WEP/WPA key of the BT Home Hub and Thomson Speedtouch routers.\n\n@Stephen: To answer all your questions: you're probably right the the BT Home Hub v1.5 ALSO follows the same algorithm, but we probably misreported that the attack doesn't work on v1.5. This is because the rainbow tables (BTHH-keys.csv) were created using the default stkeys.exe tool which only generates keys for routers manufactured in the year 2005 and 2006. When attacking the BTHH v1.5, just change the following line in the source code from:\n\n<pre><code>for(year = 5;year &lt;= 6;year++) {</code></pre>\n\nto:\n\n<pre><code>for(year = 5;year &lt;= 8;year++) {</code></pre>\n\nand recompile.\n\nI'd be a good idea to regenerate BTHH-keys.csv adding 2007 and 2008 for attacking the BTHH v1.5. However, the number of possible keys would be increased from 80 to 160 approximately I believe.\n\nstkeys.exe (live generation of keys): http://weiss.u40.hosting.digiweb.ie/stech/stkeys.zip\n\nBTHH-keys.csv (pre-generated keys): http://conference.hitb.org/hitbsecconf2008dubai/materials/D2T1%20-%20Adrian%20Pastor%20-%20Cracking%20Into%20Embeded%20Devices%20and%20Beyond.zip"
  },
  {
    "author": "Kevin Devine",
    "avatar": "151aa5852da77e782a5ec02fcb904bc1",
    "date": "2008-06-15T14:10:42.000Z",
    "content": "@stephen\r\n\r\nSince i passed the info to Adrian, i take responsibility for the mis-reporting..there was a lack of valid S/N's and other information in initial tests which is why i believed v1.5 was safe.\r\n\r\nstkeys worked for 2005 - 2006 because the router i had was manufactured in 2006.. and some S/N's collected from hrodgar were from 2005.\r\n\r\nmore people gave hrodgar S/N's for 2004 up to 2008, and a different version was written to try speed things up.\r\n\r\nIf you look at http://weiss.u40.hosting.digiweb.ie/stech/x_stkeys.c - it generates all known years, but only for routers using 24 bit SSID.\r\n\r\nexclusion of BT HH SSID is because too many keys were generated with only 16 bit input.. also Thomson routers by default in Spain use WPA which is obviously much harder to crack than WEP.\r\n\r\nfor this reason, BT HH keys were never really tested afterwards and it was still believed v1.5 used a different algorithm.\r\n\r\ninteresting to know it worked for you."
  },
  {
    "author": "alias",
    "avatar": "414f4a19eb82974e5aa2cd14e653a604",
    "date": "2008-06-16T12:29:29.000Z",
    "content": "Just a small query for Edward Pearson, I have followed your method, and i must say it is a lot easier for windows. \n\nI encounter a problem though, i have WZC enabled and  follow the process.\n\nBut I get an error \n\n<pre><code>\"Trying Key: \n2BE704DA74\n\nC:\\Documents and Settings\\me\\Desktop\\BTHHkeybf\\BTHHkeybf.vbs(27, 2) (null): This\n application has failed to start because the application configuration is incorr\nect. Reinstalling the application may fix this problem.\"</code></pre>\n\nAny help would be much appreciated"
  },
  {
    "author": "sirius",
    "avatar": "16aee736b5337361fa5c927873ad3368",
    "date": "2008-06-18T01:45:48.000Z",
    "content": "Ok, awesome find guys, thanks for all the effort.\n\nWith regards to the step by step written by Edward, I have followed all the steps, got all possible keys to output to a file and then when I execute \"cscript BTHHkeybf.vbs BTHomeHub-xxxx key.txt\" (or whatever outputted files name was) it displays:\n \n<pre><code>\" Trying Key: xxxxxxxxxx (first key in outputted file)\nAlive\"</code></pre>\n\nAnd just sits there seemingly doing nothing, it doesn't seem to attempt to connect to a network, or really do anything for that matter,  WZC is enabled and started and I'm sure I've done everything to a t, can anyone offer any help at all please?"
  },
  {
    "author": "Edward Pearson",
    "avatar": "9fb0dccdb63d79f445b757928a33fdc4",
    "date": "2008-06-18T10:37:37.000Z",
    "content": "Guys,\r\n\r\nAs I explained, this is something I wrote late at night so I could check my e-mail. \r\n\r\nHave a look at the VBScript, there's plenty that could go wrong.\r\n\r\nTo reiterate:\r\nThis will not work on Vista.\r\n\r\nThis will not work unless the Windows \"Wireless Zero Config\" is active. Not a 3rd party program.\r\n\r\nThis relys on \"zwlancfg.exe\" to automate WZC, if it doesn't work, then neither will this script.\r\n\r\nBefore you run the script, you must first disconnect any and all wireless networks. \"Automatic\" networks, must be set to \"Manual\".\r\n\r\nThe script works by adding a new Automatic wireless profile to WZC, at which point Windows should automatically try to connect, if automatic connections are off, then this script will fail.\r\n\r\nWhen the script displays \"Alive\", it means it has added the profile to WZC, and is waiting for a wireless connection to be established (it does this by checking signal strength). Open WZC and look at the target network, what is it's status?\r\n\r\nOnce a connection has been established, a normal Windows install will attempt to get an IP through DHCP, again, this must be enabled for this to work.\r\n\r\nMy script will wait 3 seconds (ample time for DHCP to respond on my machine), and then attempt to ping Google, it that fails, it'll disconnect and move onto the next key.\r\n\r\n0days of old often contained deliberate mistakes to deter script kiddies. If you don't understand what's going on here, then try and learn rather than hoping somebody will come up with instructions you can blindly follow.\r\n\r\nIf you're not capable of understanding what the script is doing, and where it may go wrong, then you don't deserve free internet. Do what most of us did and work it out for yourselves, it's not that hard."
  },
  {
    "author": "sirius",
    "avatar": "16aee736b5337361fa5c927873ad3368",
    "date": "2008-06-18T21:24:54.000Z",
    "content": "Hi, \r\n\r\nThank you for the reply and all you're work. Just to clear this up, I am not attempting to get free Internet, I am attempting to progress my knowledge of network security and am trying to use this script on my own BTHomehub, my WEP key is in the genrated list however I wanted to see how the script operates and watch it in action, I apologize if I have offended you with my questions, however I was just looking to learn as research can only get you so far, I was looking for some input from someone experienced on this field, which you have given me in your last post, I will check everything over and have another attempt, thank you for your info!"
  },
  {
    "author": "Edward Pearson",
    "avatar": "9fb0dccdb63d79f445b757928a33fdc4",
    "date": "2008-06-19T09:35:11.000Z",
    "content": "To be quite honest sirius I didn't mean you. There are a number of people above who just can't be bothered"
  },
  {
    "author": "alias",
    "avatar": "414f4a19eb82974e5aa2cd14e653a604",
    "date": "2008-06-19T10:02:12.000Z",
    "content": "@Edward\r\n\r\nI have checked everything, and what I get is It sits at alive then i fail to get an IP and it says limited connectivity.\r\n\r\nI know its frustrating getting all these questions, but I am just curious to why it doesnt want to work"
  },
  {
    "author": "Kevin",
    "avatar": "95caa0f0c038ae6c2517980866dd5672",
    "date": "2008-06-19T13:10:02.000Z",
    "content": "When I come to run the BTHHkeybf.vbs file, i got the following message;\n\n<pre><code>Trying key: 1234567890\nC:\\BTHHkey.vbs(27,2) (null): This application failed to start because the application configuration is incorrect. Reinstalling the application may fix this problem.</code></pre>\n\nAm I doing something blatently wrong or do I need to go in and change the script?\n\ncheers\n\nkev"
  },
  {
    "author": "nic",
    "avatar": "0cabc6668abb92a070dd425b20e3556d",
    "date": "2008-06-19T20:19:40.000Z",
    "content": "I get the same hanging problem after it prints 'Alive'\r\nI'm runnin XP SP3 though, so maybe that's the problem?\r\nThe waitToDie function never exits..."
  },
  {
    "author": "nic",
    "avatar": "0cabc6668abb92a070dd425b20e3556d",
    "date": "2008-06-19T20:22:16.000Z",
    "content": "I think updating to the latest version of Zwlancfg might solve the SP3 problem :-\r\nhttp://www.engl.co.uk/products/zwlancfg/history.htm"
  },
  {
    "author": "sirius",
    "avatar": "16aee736b5337361fa5c927873ad3368",
    "date": "2008-06-20T00:24:10.000Z",
    "content": "Ok, with some additional research and a slight edit to the script I have got this up and running. Just for anyone who is interested I had to update the xp install on my laptop with a specific hotfix which updated wireless settings/files on the machine. I also downloaded the latest version of the zwlancfg, I also changed the dhcp timeout to 7 seconds as the 3 didnt seem enough for my connection for some reason. \r\n\r\nAfter these changes the script successfully run and connected to my network! \r\n\r\nThank you for releasing this as I have learned a fair bit of knowledge during the pursuit of getting this up and running."
  },
  {
    "author": "Edward Pearson",
    "avatar": "9fb0dccdb63d79f445b757928a33fdc4",
    "date": "2008-06-20T10:31:06.000Z",
    "content": "Glad you guys managed to get it working, good call as well, it never occured to me that Microsoft may have broken it when SP3 arrived."
  },
  {
    "author": "Tomashavenger",
    "avatar": "c8cd8da2f18b3e04761793d543691b73",
    "date": "2008-06-22T10:05:08.000Z",
    "content": "When will the default algorithm for Sky routers come out"
  },
  {
    "author": "Kevin",
    "avatar": "4b3dd3a19552f952a1e32f7afc8c446d",
    "date": "2008-06-25T08:07:56.000Z",
    "content": "Ok - i've got the script working, yet i cant seem to find out where to change the dhcp timeout from 3 seconds to 7 seconds?\r\n\r\nScript runs and shows trying key \"************\" with ALIVE under it - then just sits there -hanging about - doesnt try and connect or anything - WZC is enabled and have latest version of zwlancfg, also ran the xp hotfix etc without sp3."
  },
  {
    "author": "Ninjamin",
    "avatar": "77865884e4250194babc00f74d128740",
    "date": "2008-06-25T09:00:46.000Z",
    "content": "Sirius what was the hotfix that you used? As I'm having the same problem with XP Sp3"
  },
  {
    "author": "ginjon",
    "avatar": "c8becbd5b0879ac5f676a1fc906b8959",
    "date": "2008-06-26T13:29:40.000Z",
    "content": "does anyone run xp media center edition i cant seem to get the zwcnfig to run when i attempt to run the newer version liked above i get a mesage stating that i need vista or xp pro sp2 or sp3 i downloadd sp3 bot when instaling i am told it is not a valid win32 apliation is it possible to actually do this attck with media center or not"
  },
  {
    "author": "Simon",
    "avatar": "aff482679d294d0959aa872233548643",
    "date": "2008-06-30T09:23:11.000Z",
    "content": "Edward (or anyone who can assist)\r\n\r\nI have successfully managed to get your VB script working, in that if I edit the key file to conmtain my key as the first line it will connect.\r\n\r\nWhen I put my key as the second line (either in the string or making the file line by line) it fails to read it and hangs at the \"Alive\" prompt showing the first key.\r\n\r\nI have read the script and can understand the process being followed, but cannot see why it would hang..... I know it works (as proven above) but cannot get the loop to loop....\r\n\r\nAlso just to note for all others that this will work on a non BT HH router(the script to connect) but you need a different way to generate the keys. (anyone figured out any other alogrithms yet... I have tried but seemingly failed miserably).\r\n\r\nThanks for any assistance."
  },
  {
    "author": "Edward Pearson",
    "avatar": "9fb0dccdb63d79f445b757928a33fdc4",
    "date": "2008-06-30T14:39:03.000Z",
    "content": "Kevin: To change the DCHP timeout, look for \"3000\" in the code, change this to Seconds * 1000.\r\n\r\nAs stated, there isn't that much that can go wrong, I suggest all of you having problems go here: http://www.engl.co.uk/products/zwlancfg/index.html and download the latest copy of zwlancfg.\r\n\r\nOne problem I have experianced in Vista (as stated, this WILL NOT WORK in Vista), is that you can't use my method to query the WMI, and check the wireless is up, as this will cause it to hang BEFORE displaying \"Alive\". If it's hanging after this I sugget you look at the \"waitToDie\" method, although if \"waitToStart\" works, I don't see why \"waitToDie\" wouldn't.\r\n\r\nThe only other thing I suggest is you add a few: WScript.Echo \"Reached line X\" in some choice places, and find out where its failing from.\r\n\r\nWhy not try and execute zwlancfg yourself, try and add a profile? Think outside of the box people.\r\n\r\nI have done my best to support this script, in the past comments I have outlined, in detail, exactly how it works, if you can't do some simple debugging on a basic VBScript, then too bad.\r\n\r\nGame Over, its up to you lot now."
  },
  {
    "author": "Gary",
    "avatar": "086a9a8e83f1b5a88b77c9c76085c170",
    "date": "2008-07-12T18:46:49.000Z",
    "content": "I've made a Vista version of Edward's script.\r\nIt's available here: http://www.mediafire.com/?xt2ntupftty\r\n\r\nIt will be slower as I can't be bothered to figure out the Vista equivalent of the WMI part.\r\n\r\nBut it works :)"
  },
  {
    "author": "gavin",
    "avatar": "47da65c87f2881eea7422bb7458dc8f0",
    "date": "2008-07-13T18:41:37.000Z",
    "content": "is there some kind of step by step as i dont no how 2 run the script any one with any info on this would b great and sorry if im asking dum stuff but i like finding out new things"
  },
  {
    "author": "ginjon",
    "avatar": "c8becbd5b0879ac5f676a1fc906b8959",
    "date": "2008-07-14T09:54:28.000Z",
    "content": "@gavin\r\n\r\nthere is a step by step at the top of the thread posted by edward pearson. which i am afraid is the only one you will find. \r\n\r\ni have also noticed that ppl on here like not to be asked questions. i have posted twice already and got no reply to any of my questions. \r\n\r\ni personally just went on to use backtrack linx and sorted it that way if you ask me personally it sucks to not get a reply in a forum but this ones a bit strange. \r\n\r\nany way good luck on finding some info. by the way i believe running the scripts within linux it the answer."
  },
  {
    "author": "Edward Pearson",
    "avatar": "9fb0dccdb63d79f445b757928a33fdc4",
    "date": "2008-07-17T10:00:45.000Z",
    "content": "ginjon,\n\nI read thirteen posts from me above this one. Almost all of them are answering questions put to me by people who COULDN'T BE BOTHERED to either read the article, code, comments or all three. Not to mention the others who are also doing their very best to answer your inane questions.\n\nTo suggest we've not tried to be helpful is both untrue, and frankly rather rude. Some commercial products receive less support than you lot are getting.\n\nIf you can't understand the processes described above, then you WON'T make any progress with this. Give up.\n\nI only came here to mention the new BTHomeHub 2.0 and to ask if anybody has one yet, but seeing comments like yours from ungrateful people who have made NO effort to understand the subject matter really does annoy me.\n\nYou can bet your bottom dollar that if you DO get it working, you won't bother posting your solution and we'll never hear from you again.\n\nWeak guys, real weak.\n\nEd"
  },
  {
    "author": "ginjon",
    "avatar": "c8becbd5b0879ac5f676a1fc906b8959",
    "date": "2008-07-17T13:58:53.000Z",
    "content": "ed my friend you can bet your bottom dollar and even your wife,house and car for that matter. when i get up to speed with this i \"WILL\" post my solution and you \"WILL\" hear from me again. \r\n\r\nas a 100% noob to any sort of pentesting and to linux fullstop. then being able to understand what they are for will take a little more time than is expected. as compared to a person who is a veteran such as yourslf. you, i suppose have been running and writing script for years and i however have been learning for like three months starting from the very beginning. \r\n\r\ni do believe there was a time in your life where you knew absloutley nothing about programming or pentesting. only problem is i just wanted to learn how to make my ap more secure. but now the realisation of just how much there is to learn about, not only the bthh but about all aspects of programming, pentesting and remote exploitation has got me studying perl, c++, backtrack, ubuntu and anything else i find and feel that is relevent. i diddnt mean to sound twatish but i got no direct replies which is what bothered me. so sorry for being upperty but as i say all i wanted was to make my ap real secure. i thought there would be a simple explaination of how to do this but i was wrong. as there is (which i know now) no simple explaination as without knowlege of what hackers can do then basically your screwed. \r\n\r\nso i appologise once again if i offended.\r\n\r\nif i had of gotten an answer when i first posted that these tests were written to be used within linux then i would of not asked such rediculouse questions.\r\n\r\nis there a forum on gnu citizen you could suggest i take a look at. like a newbie area or similar. something basic to build my knowledge."
  },
  {
    "author": "noob",
    "avatar": "ef5e34c391e4bf0ad962221cbbe9f72e",
    "date": "2008-07-24T11:05:59.000Z",
    "content": "Well after week after week of trying to get this great script working.\r\nI have finally got this working on my hub thanks to Edward Pearson and Gary for his vista script.\r\n\r\nI followed everything to a \"T\" and could not get the script working with win xp.\r\nI tried various methods to get this script working but nothing was having it.\r\n\r\nI put it down to zwlancfg not working for me although it does work manually.\r\n\r\nSo i tried this vista script which uses netsh commands for making wifi profiles and lo and behold after 3-4minutes im here typing this.\r\nmany many thanks to all involved."
  },
  {
    "author": "Edward Pearson",
    "avatar": "9fb0dccdb63d79f445b757928a33fdc4",
    "date": "2008-07-24T13:26:26.000Z",
    "content": "Sorry bout the delay in my reply, I've been in Croatia.\r\n\r\nGlad to hear people are making progress.\r\n\r\nginjon, I obviously misjudged your intentions, and perhaps I was a tad harsh. It was 8:45, pre-coffee, and you caught the vitriol that was really aimed at the minimum-effort crowd above you.\r\n\r\nI'm feeling guilty about losing my rag, so here's my MSN messenger whatsit, if you still need help msg me and we'll sort it out then and there.\r\n\r\nMSN: eddypearson{at}gmail{dot}com"
  },
  {
    "author": "toby",
    "avatar": "f40fbb0369d33d209afee6478f930e29",
    "date": "2008-07-29T21:38:12.000Z",
    "content": "can you plz email me the windows xp vesion for the 2 files at\r\n(tattootroy(at)gmail(dot)com"
  },
  {
    "author": "Jordan",
    "avatar": "ae106c6a501e564b0f932e5c6a52c8c7",
    "date": "2008-07-30T08:36:37.000Z",
    "content": "Dam THANK YOU EDWARD! very skillfull and works great! thank you for your help, very much apreciated!!!!"
  },
  {
    "author": "Edward Pearson",
    "avatar": "9fb0dccdb63d79f445b757928a33fdc4",
    "date": "2008-07-30T08:43:36.000Z",
    "content": "I'm feeling rather sheepish.\r\n\r\nIt would appear that the zwlancfg.exe I packaged with my last release was missing some vital libraries, as a result it wouldn't have worked unless you had the bright idea of downloading them.\r\n\r\nhttp://www.facecrook.net/BTHHkeybf.zip\r\n\r\nZip updated, sorry for the inconvenience."
  },
  {
    "author": "ginjon",
    "avatar": "c8becbd5b0879ac5f676a1fc906b8959",
    "date": "2008-07-31T11:41:46.000Z",
    "content": "does any one else run xp media center? i am having the same hanging problem as some of the other guys.also i get this.\r\n\r\ntrying key: *******\r\nalive\r\nkey:******\r\n\r\nthen a return to my command line.\r\n\r\ni am wondering if it is something to do with my system setup. i have been working along with ed to try and get this working on my system. (thanks ed you the boy-o all your help is superb) afte trying various methods it just wont work lol WELL IT WILL but i am missing somthing. although not sure what. ed has enlightened me in so many ways that i can now actually understand whats happening with the sript :D YEY. does any one have any suggestion."
  },
  {
    "author": "troy troy",
    "avatar": "f40fbb0369d33d209afee6478f930e29",
    "date": "2008-07-31T15:11:15.000Z",
    "content": "can you please upload the working files for windows xp. plz"
  },
  {
    "author": "ginjon",
    "avatar": "c8becbd5b0879ac5f676a1fc906b8959",
    "date": "2008-07-31T16:45:13.000Z",
    "content": "hi guys, ive got the script to run but thing is it takes like 10 mins to try the next key????????????\r\nin some instances it has just hung until the comp goes into hibernate after being left for a goood while then it checks the next key when it comes out of hibernation. i have change the dhcp time out to 10 seconds and even to 20. i can see visably that the key is tried and wzc is trying to connect. after sed time when it is supposed to try the next key it hangs. as i say after a while it does try the next key:\r\n\r\ni get :\r\n\r\ntrying key:******\r\nalive\r\ndead\r\nfailed.\r\ntrying key:*****(next in the list)\r\nalive\r\n\r\nproblem is at this rate it will probs take like three weeks to get in to he hub. and no way am i waiting for the computer to hibernate before it tries the next key. i know i have got something wrong some where.\r\n\r\nmy setup is:\r\nacer aspire 3690, 1.73ghz intel celeron m, 1gig ram, atheros ar5005g wireless chip.  windows xp media center edition sp3 with hotfix KB928366 for wzc, latest version zwlancfg, stkeys and BTHHkeybf.vbs \r\n\r\ni have changed the script bthhkeybf.vbs several times (with eds help) and some of my own. i just dont understand why the keys are'nt moving properly is there any sugestions on getting the loop to loop properly.       \r\n\r\nmany thanks in advance"
  },
  {
    "author": "Edward Pearson",
    "avatar": "9fb0dccdb63d79f445b757928a33fdc4",
    "date": "2008-07-31T23:40:31.000Z",
    "content": "I'll will write a proper Windows XP/Vista version with all the bells and whistes. Tomorrow.\r\n\r\nI really don't like Vista...at all. If somebody running it could MSN me at some point during the next few days, so I can test it on their system, it would save me a lot of time and effort.\r\n\r\nMSN: eddypearson{at}gmail{dot}com"
  },
  {
    "author": "Nick Kusters",
    "avatar": "9237b870254b7034f55ad4c22bba20fe",
    "date": "2008-08-01T08:11:17.000Z",
    "content": "I've used the PoC code and created an ASP.NET version of it, dumped all info in a database and put a small page online to allow you to do lookups for the Dutch SpeedTouch modems.\r\n\r\nI've added a link back here aswel.\r\n\r\nFor those interested: http://www.nickkusters.com/articles/79/Online_SpeedTouch_WPA_Key_Lookup.aspx"
  },
  {
    "author": "Edward Pearson",
    "avatar": "9fb0dccdb63d79f445b757928a33fdc4",
    "date": "2008-08-01T09:01:33.000Z",
    "content": "Nick,\r\nI like it, would be nice if you'd allow for other ISPs network SSIDs, BTHomeHub-6950 for example.\r\n\r\nEd"
  },
  {
    "author": "anon",
    "avatar": "7622859279504bc941265d41b0cc60da",
    "date": "2008-08-01T09:38:41.000Z",
    "content": "This site will calculate the default WPA key for Sky routers, it will only give the Netgear white router. Try it!! https://www.cm9.net/skypass/"
  },
  {
    "author": "Nick Kusters",
    "avatar": "9237b870254b7034f55ad4c22bba20fe",
    "date": "2008-08-01T09:58:46.000Z",
    "content": "Dear Edward,\r\n\r\nFirst of all: thank you for your positive response!\r\n\r\nI will be back from holiday in 2 weeks. I'll modify my code to store the full hash, allowing any kind of lookup you want.\r\n\r\nI'll be looking into creating a tool that wil auto-probe available WiFi networks (BT/SpeedTouch) and auto connect to any available router. This will take me some more time (havn't worked with the wlanapi yet), but I'm sure it will all work out :)\r\n\r\nGreetings,\r\n\r\nNick Kusters."
  },
  {
    "author": "Edward Pearson",
    "avatar": "9fb0dccdb63d79f445b757928a33fdc4",
    "date": "2008-08-01T15:21:09.000Z",
    "content": "Nick,\r\nNice idea! I've been working on a Python framework for automating the process of \"hacking\" various bits of hardware. It's very extensible, adding new target systems involves implementing a very simple interface. It's growing every day, will probably never be \"finished\" and may well remain private depending on how effective it is.\r\n\r\nThat said, I've been using the wlanapi during today's rewrite of my VBScript (in C#), and I think I've got my head around it. Are you up for a little collaboration on your AutoPwn-Wireless prog? I have several *much* less well known exploits for popular hardware, and would rather like to build a Wireless specific app of this sort, I know I'd use it.\r\n\r\nIf you're interested, please see my MSN address above.\r\n\r\nBest Wishes\r\n\r\nEd"
  },
  {
    "author": "troy troy",
    "avatar": "f40fbb0369d33d209afee6478f930e29",
    "date": "2008-08-02T03:06:47.000Z",
    "content": "hello Edward Pearson\r\nthanks for your hard work. by any chance is the windows xp software you are working on finish as  yet?"
  },
  {
    "author": "Hans",
    "avatar": "5b2dc0a9dbf0c99b85ac0a621b94ccb3",
    "date": "2008-08-02T17:28:48.000Z",
    "content": "The link to Kevin’s stkeys.zip tool does not exist anymore. Please provide correct one."
  },
  {
    "author": "Kevin Devine",
    "avatar": "151aa5852da77e782a5ec02fcb904bc1",
    "date": "2008-08-03T19:05:22.000Z",
    "content": "stkeys..etc are now archived in nosmoht_stuff.tar.gz\r\n\r\nthis is because the hosting provider asked me to remove the links to netopia/thomson vulnerability info.."
  },
  {
    "author": "ginjon",
    "avatar": "c8becbd5b0879ac5f676a1fc906b8959",
    "date": "2008-08-05T15:07:19.000Z",
    "content": "hi guys: the script is finally working!!!! \r\n\r\nafter a lot of complications, a long drawn out period of time and a lot of effort. but what was the solution you may ask! \r\n\r\nwell it's this, \r\n\r\nthe original bthhkeybf.vbs wouldnt work so Eddy pearson gave me an updated one. still, nothing happened. it got to the point of trying key: ****** and just hung. after a few choice commands inserted in a few choice places (courtiously provided by Ed) there was still no action.\r\n\r\nEddy pearson and I worked on and off for like a week or more to get this thing going.Eddy pearson tried, tried and tried again to work out what was wrong, but no matter what he or myself tried we got nothing. I eventually put it down to a Picnic problem on my part (Problem in chair not in computer P.I.C.N.I.C). However the script just wouldnt work. I tried running this script against various networks and hubs and got nothing. after Eddy provided me with even more script edits and had me run various checks on my system, Eddy was ready to admit defeat!!!! yes thats right poor Eddy was P***ed right off and spitting feathers.\r\n\r\nnow i was playing around at like 11.30pm or so maybe midnight and fuck me it was working.\r\n\r\nnow then the network i was connected to was an unsecured network that had a better signal than the hub. for some unknown reason this network was disallowing the script to run properly. although, the prefered network list had been cleared it caused the script to crash and just hang. the cause of this was the checkbox along side \"Automaticly Connect To Non Prefered Networks\" within WZC. \r\n\r\nPeople DO NOT check this box. \r\n\r\ni had this set up from a while ago when i was an installer for sky (travelled a lot you see needed a conection) and i diddnt know anything about \"offensive security\". this was causing my wireless to automaticly connect to the network with the best signal. so as the script tried to connect, so did the non preferred network thingy. thus causing them to cancel each other out. i unticked it and bang there it was. a working script.   \r\n\r\nman was i pleased. and Eddy welllll.. Eddy was no longer spitting feathers, he stuck them in his cap and danced round the camp fire, half naked, till it rained. (Not literally lol)\r\n\r\nany way i got a good nights sleep without waking up thinking about getting the script to work and Eddy received my confirmation of a working script pre-coffee so hopefully it give him a good start to the day.\r\n\r\nsee look another happy ending.\r\n\r\nI hope this might be some help to someone out there."
  },
  {
    "author": "securio",
    "avatar": "5cadbdb53d09b8eca838ab769d0f8a27",
    "date": "2008-08-10T15:13:41.000Z",
    "content": "Brilliant article ,BT have released a version 2.0 homehub now , with WPA encryption they are advertising high security although it still comes with \"sticker\" encryption default codes , do you think this can also be reverse engineered , the examining of the security certificate using https://api.home still works to get the serial number although the \"sticker\" ssid now contains non hex characters , have tried the stkeys gen and due to non hex characters unfortunatley does not work , have they finally locked it up good and proper due to your hard work and research or can you show them up again ? Any help I can be which isn't much without direction in trying to reverse engineer the new codes would be greatfully undertaken.  Perhaps this will be a new direction considering this is going to be the must have router for the media driven consumers in the uk.\r\n\r\nGood Work guys"
  },
  {
    "author": "Edward Pearson",
    "avatar": "9fb0dccdb63d79f445b757928a33fdc4",
    "date": "2008-08-12T15:17:32.000Z",
    "content": "Well, it's something to shoot for.\r\n\r\nPlease post:\r\n\r\nA) Serial Number\r\nB) MAC Address\r\nC) Default SSID\r\nD) Default Key\r\n\r\nand we'll see if we can make sense of it all."
  },
  {
    "author": "Anon",
    "avatar": "aff482679d294d0959aa872233548643",
    "date": "2008-08-12T16:21:04.000Z",
    "content": "If you could provide details of a V2 hub of\r\nMAC address\r\nSSID\r\nSerial No\r\nWPA key\r\n\r\nI'llhappily run this through the conversion I know of for other WPA algorithms."
  },
  {
    "author": "Adrian 'pagvac' Pastor",
    "avatar": "0367b81839d31a5fa3d7bea79ef71b9e",
    "date": "2008-08-12T22:25:10.000Z",
    "content": "@securio: what's the SSID syntax used by the BTHH 2.0? Even if the key prediction attack doesn't work on version 2.0, most of home hubs out there are version 1.0 and 1.5 which ARE vulnerable. Nevertheless, I'd love to play with version 2.0 although I don't have one atm.\r\n\r\nAlso, could you try the MDAP attack to get the S/N on version 2.0?: http://www.gnucitizen.org/blog/dumping-the-admin-password-of-the-bt-home-hub/\r\n\r\nNote: I think the attack script only works on Linux"
  },
  {
    "author": "Adrian 'pagvac' Pastor",
    "avatar": "0367b81839d31a5fa3d7bea79ef71b9e",
    "date": "2008-08-12T22:40:25.000Z",
    "content": "@securio: can you confirm that version 2.0 uses WPA PSK by default? \r\n\r\nIf BT has reduced the number of possible default SSIDs by removing the hex digits, it might be quite easy to crack the key using the coWPAtty Precomputed WPA Attack. We would just need to generate the rainbow tables for all possible SSIDs using genpmk: http://wirelessdefence.org/Contents/coWPAttyMain.htm"
  },
  {
    "author": "troy troy",
    "avatar": "f40fbb0369d33d209afee6478f930e29",
    "date": "2008-08-13T02:33:28.000Z",
    "content": "so no one ha sthe windows xp exe for this. lots of people geting it to work but but wont post links. verry funny"
  },
  {
    "author": "simon",
    "avatar": "aff482679d294d0959aa872233548643",
    "date": "2008-08-13T08:11:43.000Z",
    "content": "I ran airodump this morning on the way to work and picked up 73 HomeHubs, 22 of the MACS start with 00:14:7F, 23 with 00:18:F6, 21 with 00:1D:68, 5 with 00:1F:9F and 2 with 00:90:D0.... I am guessing these relate to the version of wireless card inside the router, does anyone know which ones are which version?  All SSID have 4 HEX characters.  Just curious...\r\n\r\nAlso I gave tried to dechipher the BTBusinessHub, got as far as realising the SSID is made from the SN (the fusion SSID is also the normal SSID with 1 extra character)"
  },
  {
    "author": "Edward Pearson",
    "avatar": "9fb0dccdb63d79f445b757928a33fdc4",
    "date": "2008-08-13T14:56:35.000Z",
    "content": "Adrian,\r\nI may have totally misunderstood, but securio wasn't saying that they've removed the hex digits, leaving only \"BTHomeHub\", but rather that they're using a new format involving ASCII characters, rather than just giving us hex bytes.\r\n\r\ne.g BTHomeHub-GD0CTN\r\n\r\nSo it's not going to make generating tables any easier. Uninformed Dictionary attacks are rather uninspiring things anyway.\r\n\r\nIt'd be GREAT if somebody with a BTHH 2.0 could follow this up and post the details requested above, and if possible, a rip of the CD BT distributed with the router (remember Kevin's research chaps.)\r\n\r\nBefore we go much further it would be advantageous to know weather the new Hub is still Thompson hardware.\r\n\r\nBasically bring as MUCH info as you can muster and we'll try and come up with a similar hack. I'm rather excited to get started, so please be quick :D"
  },
  {
    "author": "Edward Pearson",
    "avatar": "9fb0dccdb63d79f445b757928a33fdc4",
    "date": "2008-08-13T16:24:58.000Z",
    "content": "Last thing, I don't suppose anybody thought of converting the ASCII to Hex and running it through stkeys?\r\n\r\nJust a thought"
  },
  {
    "author": "securio",
    "avatar": "5cadbdb53d09b8eca838ab769d0f8a27",
    "date": "2008-08-14T11:46:55.000Z",
    "content": "Thanks for the reply everyone good to see everyone is still keen sorry it's a bit late but heres what you asked for :\n\nOk the Mdap attack still works heres the output \n\n<pre><code>ANT-SEARCH MDAP/1.1\n46\nREPLY-ANT-SEARCH MDAP/1.1\nANT-ID:0825JH09Y\nANT-NAME:BTHomeHub 2.0A\nANT-MAC:00-1F-9F-3E-26-3C\nANT-HOSTSETUP:auto\nTO-HOST:192.168.1.64:32782\nTP-VERSION:2.0.0\nMBUS-VERSION:3.27.0.0-r810\nMDAP-VERSION:1.2\n4E</code></pre>\n\nSo from that : (and confirmed from the stickers)\n\n<pre><code>MAC = 00-1F-9F-3E-26-3C\nS/N = CP0825JH09Y\nDefault SSID - BTHomeHub2-2RRC  ,(Handy as the version is now broadcasted as default)\nDefault WPA-2 Personal key - 7279e24999</code></pre>\n\nLooks like they've covered up the MDAP attack as the default admin password is - MAGFQC01\n\nThere are also other codes on there that someone might make sense of -\n\n<pre><code>CUP - DSLCTUR2BTBET\nBULK - DSLCBAR2BTBH3</code></pre>\n\nAlso just a random sticker on the bottom saying <code>MBCTUR2BTBE2</code>\n\nHope this helps . I should be able to get details of a second one as will only have this one temporary, anything else you would like me to try I would gladly help \n\nCheers"
  },
  {
    "author": "Kevin Devine",
    "avatar": "151aa5852da77e782a5ec02fcb904bc1",
    "date": "2008-08-27T02:45:59.000Z",
    "content": "Concerning the default password which might just be random value.\r\n\r\nOn some routers there are undocumented algorithms that generate \"Factory\" passwords.\r\n\r\nThese allow access to the router even if admin password is setup.\r\n\r\nMost of the algorithm use nothing more than modular arithmetic creating a string from the MAC of router."
  },
  {
    "author": "Securio",
    "avatar": "5cadbdb53d09b8eca838ab769d0f8a27",
    "date": "2008-08-28T10:41:45.000Z",
    "content": "Hi All,\r\n\r\nDon't know if this is of interest but as the home hub 2 uses GPL they have had to release the source code the link is here http://www.btyahoo.com/broadband/adhoc_pages/gplcode.html\r\nIf everyone already knows this sorry for wasting your time \r\n\r\nCheers"
  },
  {
    "author": "Geoff",
    "avatar": "494f715cdb391c3c409f6f390506e641",
    "date": "2008-09-11T15:00:27.000Z",
    "content": "Is there anything similar to the BTHHKEYGEN that works with routers on \"TalkTalk\" in the UK. They seem to use WEP and SSIS of \"TalkTalk9d652\" as an example.  It always seems to be in that format although letters and numbers change after the \"TalkTalk\".  The router is a Netgear DG834G. I don't run LINUX unfortunately so can't use any of the programs like aircrack."
  },
  {
    "author": "ginjon",
    "avatar": "c8becbd5b0879ac5f676a1fc906b8959",
    "date": "2008-09-12T13:31:18.000Z",
    "content": "@eddy mainly but any one else who is interested!!!!!\r\n\r\ni just got myself a homehub v2.0.\r\n\r\nlet the fun begin \r\n\r\noh by the way my msn messanger thingy is down at the moment but here it is if any one wants to email me jonteyg@hotmail.com"
  },
  {
    "author": "Zebas",
    "avatar": "60a1ecb4d321c31bb06ed03e3e411d09",
    "date": "2008-09-17T16:56:25.000Z",
    "content": "What about sky routers? Is there any app that calculates the possible wep keys?"
  },
  {
    "author": "Simon",
    "avatar": "aff482679d294d0959aa872233548643",
    "date": "2008-09-23T10:26:32.000Z",
    "content": "The Tiscali router algorithm is as follows:-\r\n\r\n<pre><code>MACS code digit\r\n1 - 12th digit of MAC\r\n2 - from S/N - needs rainbow table for 4096 combinations\r\n3 - 6th digit of MAC\r\n4 - 10th digit of MAC\r\n5 - 5th digit of MAC\r\n6 - 9th digit of MAC\r\n7 - 12th digit of MAC\r\n8 - 8th digit of MAC\r\n9 - 10th digit of MAC\r\n10 - from S/N - needs rainbow table for 4096 combinations\r\n11 - 11th digit of MAC\r\n12 - from S/N - needs rainbow table for 4096 combinations</code></pre>\r\n\r\nWould be good if someone could develop program to create all combinations (similar to STkeys but with 9 characters known).  \r\n\r\nEdward/Nick - would you be interested in building this into you auto wifi?\r\n\r\nAnyone got any new router algorithms?"
  },
  {
    "author": "tattootroy",
    "avatar": "f40fbb0369d33d209afee6478f930e29",
    "date": "2008-09-23T10:38:29.000Z",
    "content": "i think talk talk is blocking this site on there system i cant log on direct , i had to paste this web link in google translate, \r\n\r\nsome funny stuff going on"
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2008-09-23T10:55:48.000Z",
    "content": "some people cannot differentiate between a malicious site and a legit information security site. well,... we've got to educate them even more."
  },
  {
    "author": "slim76",
    "avatar": "faa7bf327a6fcf26a366637f6c9eb1e2",
    "date": "2008-09-25T00:25:10.000Z",
    "content": "Tiscali WPA2 Formula. I would just like to inform people that it was me slim76 that found the wpa2 formula for tiscali gigaset routers,I posted it on remote-exploit.org a few days ago to see if someone could help me find the missing three digits!\r\n\r\nHere is my post as proof\r\nhttp://forums.remote-exploit.org/showthread.php?t=15965a \r\n\r\nMy reason for this post is because ive had people trying to steal my findings and palm them off as their own!"
  },
  {
    "author": "Anon",
    "avatar": "aff482679d294d0959aa872233548643",
    "date": "2008-09-25T12:16:57.000Z",
    "content": "Slim - from reading your posted link it was Letmein who posted the algorithm?\r\n\r\nIs it not you claiming someone elses findings???\r\n\r\nEither way not that relevant now its in the open"
  },
  {
    "author": "slim76",
    "avatar": "faa7bf327a6fcf26a366637f6c9eb1e2",
    "date": "2008-09-25T23:14:39.000Z",
    "content": "No they wasnt his findings, they were mine!\r\n \r\nThose details came from my routers and not his, ask him how he worked it out without having the serials of the routers, Also if you read my post where i first posted the details you will see i already said it was made up from the mac address, how would i have known that if i had not already worked most of it out!\r\nIt dont really matter, That is the incorrect formula anyway! However it does still work if your using it to bruteforce a handshake. SIX of the digits in the passkey come from the SERIAL and the other SIX are from the MAC address!"
  },
  {
    "author": "Anonymous Coward",
    "avatar": "f06fcdba81e8ab57d6cabe65dee18b52",
    "date": "2008-09-30T18:29:32.000Z",
    "content": "I realise this is probably old hat by now, but wth. I could only find hrodgar's spanish translation of the stkeys source, the .ie url having gone thoroughly 404. It lacked a Makefile, so below is a simle one that'll work with pmake and gmake. The whitespace in front of the last line is a single tab. And now I'm off to find a nearby spanish for beginners book, to see what the comments say the code does.\r\n\r\n<pre><code>CC=gcc\r\nCFLAGS=-O3 -fomit-frame-pointer -funroll-all-loops\r\nstkeys: stkeys.c sha1.c sha1.h\r\n        $(CC) $(CFLAGS) stkeys.c sha1.c -o stkeys</code></pre>"
  },
  {
    "author": "shadowswan",
    "avatar": "078ff9d65ab511a86f00e7c505b7d574",
    "date": "2008-10-03T09:25:31.000Z",
    "content": "If anyone is interested I have re-written. If you want to test it you can do so by setting your router to one of the keys in the keys.txt you are trying :)\r\n\r\nAs for the rest of the process it works fine with everything else I used xampp to load up the test.php file then copy pasted ino textedit Shift-Option-T to convert to plain text then save it in the directory with the script and run! It will need root access to run because of the way the mac runs the 'airport' command.\r\nEnjoy! \r\n\r\nThe final script can be found here: http://rapidshare.com/files/150496486/BTHHkeybf.command.zip\r\n\r\nTested on Mac OSX 10.5.5"
  },
  {
    "author": "Tomashavenger",
    "avatar": "e24b0e591e9ab592e6946ae0ca753c4b",
    "date": "2008-10-04T07:01:57.000Z",
    "content": "When is the algorithim for bthomehub v 2.0 with wpa encryption coming out I am so fascinated"
  },
  {
    "author": "mikey",
    "avatar": "c8b62ca7927985d86d6ecd381d453291",
    "date": "2008-10-09T12:15:33.000Z",
    "content": "right i have it all working wzc creates a profile i can see it aquiring ip address then disconnects......i was presuming it would go to next key but it doesnt it stays on alive......you say about changing the dhcp timeout and look for 3000 is that in the script cause i cant seem to find it......i am new to script and i am not looking for a simple answer for you to help me but a little pointer would help......as just hanging on alive is doing my head in now.....i was just going to input manually but thatll take forever lol......any help would be much appreciated"
  },
  {
    "author": "Edward Pearson",
    "avatar": "9fb0dccdb63d79f445b757928a33fdc4",
    "date": "2008-10-09T12:53:44.000Z",
    "content": "Ok chaps this will be my last post on this particular topic.\r\n\r\nThe problems a lot of you seem to be having are to do with how the script checks weather it is connected or not, I will try and explain in brief how this works.\r\n\r\nYou can query the WMI to retrieve the signal strength of a Wireless connection*, if nothing is connected, it'll throw an error**.\r\n\r\nFirst the script attempts to connect, it adds the WZC profile, and then repeatedly queries the WMI , waiting until it detects a signal strength, at which point, it will display \"Alive!\" and the DHCP timeout will begin. It is after this the problem is occurring.\r\n\r\nIf the DHCP timeout is reached and the script is unable to ping www.google.com*** it then removes the WZC profile, and now beings to query the WMI again, THIS TIME waiting for NO signal to be returned, when this happens, it displays \"Dead\" and will move to the next key.\r\n\r\nThe issue i've seen most commonly with this, are Virtual Adaptors and things of that nature WILL SOMETIMES LOG A SIGNAL STRENGTH, thus causing the script to never to reach the \"Dead\" point, which in turn means the script will not progress.\r\n\r\nTo fix this, you must make sure that there's NOTHING apart from your wireless adaptor producing a signal strengh, or alternativly find a more effecient method of checking the wireless status. This can be done VERY easily in Vista using the netsh command.\r\n\r\nThis is the last time I will say it, unless you have at least a rudimentay understanding of HOW the script works, you wont have a HOPE at getting it working if not already. So it pays to read.\r\n\r\n*This is why I say DISCONNECT all other wireless adaptors before using the script\r\n**Hence the mess of \"on error\" statements\r\n***If you access the internet through a proxy, or have some other quirk in the setup, it will ALWAYS fail, and never find the key."
  },
  {
    "author": "mikey",
    "avatar": "c8b62ca7927985d86d6ecd381d453291",
    "date": "2008-10-11T10:27:35.000Z",
    "content": "this does seem to work if i put the correct key in on the first line as it does just hang on alive.........even when i changed the timeout on the dhcp......so alli done was delete each key and had to do each one manually.......really really strange that everyone seems to be having same problem..."
  },
  {
    "author": "mikey",
    "avatar": "f0f815970203ad7f709014d7405ba0fc",
    "date": "2008-10-11T15:55:53.000Z",
    "content": "ed i have been through 3 home hubs now manually with all 229 keys that were generated and NON WORKED"
  },
  {
    "author": "mikey",
    "avatar": "c8b62ca7927985d86d6ecd381d453291",
    "date": "2008-10-14T19:15:54.000Z",
    "content": "sorry ed. i didnt change 06 to 08. I APOLOGIZE SIMPLE OVERSITE. i think i need this hotfix for wzc for sp3 anywone know what one it is"
  },
  {
    "author": "Securio",
    "avatar": "5cadbdb53d09b8eca838ab769d0f8a27",
    "date": "2008-10-16T11:57:28.000Z",
    "content": "@ed &amp; adrian , is a rip of the Homehub 2 cd still reqired if so i'll sort it out \r\n\r\ncheers"
  },
  {
    "author": "mikey",
    "avatar": "c8b62ca7927985d86d6ecd381d453291",
    "date": "2008-10-24T07:41:00.000Z",
    "content": "it finally works after some help with ginjon and ed. thanks guys. i have broad band now. lol. thank you \"drew\" lol (my neighbour). over looked one little thing how stupid ssid after both wait to die wasnt there. oh and my firewall was stopping my ping how bloody obvious. if anyone is having a problem recompiling stkeys after chasnging to '08 there is a spanish that '08 anyway still works the same find it here:\r\n\r\nhttp://foro.seguridadwireless.net/index.php/topic,11391.80.html"
  },
  {
    "author": "mat",
    "avatar": "78e30382b74c9cd4bba2ae4c00c0164e",
    "date": "2008-11-05T12:04:05.000Z",
    "content": "hi can any one please put up new link for BTHHkeybf.zip for windows please as  one above no longer works thank u"
  },
  {
    "author": "toby",
    "avatar": "26090b4414cf3dbe38921a35d8026b15",
    "date": "2008-11-06T02:38:20.000Z",
    "content": "hello i also need the windows version as the link is now dead . can you plz re upload it. regards"
  },
  {
    "author": "David William",
    "avatar": "db5911bac051220991d6ecb1323889a9",
    "date": "2008-11-15T21:34:32.000Z",
    "content": "Hey guys,\r\n\r\nI've got the wireless WEP key which is FCEB431789\r\n\r\nCan you give me the serial number of the wireless plz. I want to port forward the modem to download some torrent!"
  },
  {
    "author": "ginjon",
    "avatar": "c8becbd5b0879ac5f676a1fc906b8959",
    "date": "2008-11-20T05:18:28.000Z",
    "content": "@securio \r\n\r\nthe cd has nothing of value within its contents."
  },
  {
    "author": "Angela",
    "avatar": "b434ad52db1e1192ee6633221db60ea8",
    "date": "2008-11-27T11:13:53.000Z",
    "content": "informative post, keep it up.,"
  },
  {
    "author": "c4p0ne",
    "avatar": "75767f1903b90ed0cd2313cba138bab8",
    "date": "2008-11-27T13:44:49.000Z",
    "content": "So is it possible JUST by knowing the SSID (e.g. SpeedTouch5FB550) to decipher the default key?"
  },
  {
    "author": "lorant",
    "avatar": "b13e760510bd884a11e558370c3ebafb",
    "date": "2008-12-07T12:10:23.000Z",
    "content": "ok for speed touch it is a greate  but i find 2 ssid wich is not working (70CA8F) and (20960A) Can sombody help please? And thk for you info good job"
  },
  {
    "author": "Argento",
    "avatar": "5a44b9c64a572ab87091c44289d72340",
    "date": "2008-12-12T12:54:24.000Z",
    "content": "Hey Guys, \r\n\r\nVery good post and follow up comments. Can someone email me or post a link of Windows XP version of BTHHkeybf written by Edward pearson please.\r\n\r\nThanx a lot in advance.\r\n\r\nRegards"
  },
  {
    "author": "MrGerbick",
    "avatar": "f3122dc10b494b3ba0b37c4585ef57ad",
    "date": "2008-12-29T16:44:58.000Z",
    "content": "I stumbled across this post a couple of days ago and was intrigued at how flimsy it all is.\r\n\r\nI tested it all on a couple of Thomsons that were hanging around - one of the SpeedTouchAB1234 type, and one of the BTHomeHub-A123.\r\n\r\nThe speedtouch gave me one key back - bingo.\r\n\r\nThe Homehub gave me about 155.  This does present a minor problem, as who wants to manually try those.  But we have already seen some homebaked tools that will get around that for you.\r\n\r\nEdward Pearson mentioned a VB script he wrote that will prove the theory on windows - i don't see this anywhere now.  I wrote a very easy to use solution yesterday that does everything for the HomeHubs - you just run:\r\n\r\ncscript scriptname.vbs A123 &gt; A123.log\r\n\r\n... and youll get the correct key back within half an hour.  I have given each key plenty of time to be tried, so its not a lightning quick attack.  Its very verbose and user friendly - if anyone would like a look let me know.\r\n\r\nI might upload and post a link after ive tidied it up a bit (though it is a relatively tiny script!!!).\r\n\r\n\r\nGood topic folks."
  },
  {
    "author": "LancashireRipper",
    "avatar": "aa98d4b4945f136ce9bc5e2cfe0ee663",
    "date": "2009-01-03T18:08:20.000Z",
    "content": "anyone know how i find out me next door neighbours internet WEP key or network key thing, its a BTHomeHub-AFDD if that helps, thanks in advance"
  },
  {
    "author": "medzener",
    "avatar": "b02cfb2ff2910d6170f8016e825a0616",
    "date": "2009-01-22T07:16:15.000Z",
    "content": "anyone know how i find out me next door neighbours internet WEP key or network key thing, its a BTHomeHub-A968 if that helps, thanks in advance"
  },
  {
    "author": "luke",
    "avatar": "2796eb77975b8ea156985b649336c647",
    "date": "2009-02-13T23:27:26.000Z",
    "content": "hi i was wondering if someone could help me ... i have a BTHomeHub-480B i had the wireless key 2 days ago .. i had stuck it on my pc desk 2 save me runing up and down stairs if it had signed me out what my wife decided 2 do was bin it thinking it was rubish it also had my s/n and item code on which meens bt wont even give me a key cuz i need proof :@ i told them 2 come out and look but they wont.. i where hoping some 1 could help me find the key since i am having 2 use my m8s comp email me on oakesy2005@msn.com thnks"
  },
  {
    "author": "Sam",
    "avatar": "aaecdf5dd1d8825133c110568794db59",
    "date": "2009-02-25T23:43:21.000Z",
    "content": "What about aircrack will that work too"
  },
  {
    "author": "syred",
    "avatar": "af5fcafccb0f9b6fd466258b12a01bda",
    "date": "2009-02-26T17:19:22.000Z",
    "content": "Now there is some dsl/routers with ESSID ThomsonXXXXXX and i don't know how their serial goes in order to test what has been said in this article.. does anyone have any workarrounds with ThomsonXXXXXX ???????????..."
  },
  {
    "author": "Nick",
    "avatar": "8f4a570a54110fb33de3bacba85bf8cd",
    "date": "2009-03-04T11:07:09.000Z",
    "content": "SpeedTouchE9A99B\r\nCant Crack:("
  },
  {
    "author": "Edward Pearson",
    "avatar": "9fb0dccdb63d79f445b757928a33fdc4",
    "date": "2009-03-09T15:51:27.000Z",
    "content": "Nick:\r\nI bet you've not recompiled stkeys.c to include recent years, learn to RTFA.\r\n\r\nThe rest of you clearly haven't even begun to read the subject matter, obviously under the naive impression that somebody will take time out of THEIR day to do it for you. They wont."
  },
  {
    "author": "loogie",
    "avatar": "fd390cebbfded791a42e450c680b1593",
    "date": "2009-03-10T18:47:09.000Z",
    "content": "thanks for tge article, i have a few hubs i can try it on.. any luck with the bthh2? i'm using vista and the supplied scrpt. i disabled all the msgs so it 'should' only return a msg on success or error. is there a way to change the msgs to display in console not a msgbox? the first attempt had no luck, i'm going to make sure stkeys includes 07-08 thanks again... learning lots!\n\nto the rest who are hoping for a quick fix... no matter what sob story you come up with, noones hoing to do it for you. your not willing to put in the time, dont bother"
  },
  {
    "author": "Stas",
    "avatar": "e88bcb13aa26dea73de560115ca77b7c",
    "date": "2009-03-14T01:13:00.000Z",
    "content": "Hi guys, nice topic, helped a lot.\r\nMaybe someone of you interested in making PDA version of keygen?! It would be much more than usefull. Thx."
  },
  {
    "author": "Edward Pearson",
    "avatar": "9fb0dccdb63d79f445b757928a33fdc4",
    "date": "2009-03-23T13:41:22.000Z",
    "content": "http://www.righttooffend.com/stkeys.php\r\nEssentially does: stkeys -v -i [Form Value]\r\n\r\nI set this up for a friend. It will do years 2005-2009 inclusive. Hopefully it will solve some people's problems.\r\n\r\nMrGerbick: I'd love to see your version of BTHHkeybf. I don't really have the time or the motivation to update mine (it works, albeit not very robustly), but I'm sure there are a lot of people here who'd welcome a cleaner more comprehensive solution."
  },
  {
    "author": "daniel",
    "avatar": "22999267d57fe803b8c539b4bd0f7722",
    "date": "2009-03-27T06:23:55.000Z",
    "content": "ok so im a complete noob, i have found the 80 odd keys dor a bt home hub DD38 in the btth keys file can i just run through them ne at a time and see if it cracks it u have 7 home hubs within range im using a belkin n1 wireles usb adapter , so can i just brute force and try every key one by one as i have tme free and would that work going in to the wireless network thing in windows, any advice much appreciated as im skint and the neighbours are jokers !!! cheers in advance peeps"
  },
  {
    "author": "dev",
    "avatar": "722133a8ce83d9a514d3b6e4ea6e5688",
    "date": "2009-04-01T02:43:03.000Z",
    "content": "guys we really appreciate your efforts but can we plsss have a working direct link to your bthhbf tool???"
  },
  {
    "author": "pagvac",
    "avatar": "0367b81839d31a5fa3d7bea79ef71b9e",
    "date": "2009-04-02T15:02:25.000Z",
    "content": "@dev: BTHHkeybf can be found in the materials page of HITB Dubai 2008. Just download the \"Cracking Into Embeded Devices and Beyond\" presentation ZIP file: http://conference.hitb.org/hitbsecconf2008dubai/materials/\r\n\r\nHowever, I want to be clear that this is NOT a skiddie-friendly tool, as it can be unreliable due to its dependency on good signal strength of the target BTHH. On top of that it only works on Linux as it's based on the iwconfig tool. \r\n\r\nAlso remember that the attack only works against BTHHs v1.0 and v1.5, as v2.0 uses a different algorithm for the default wifi encryption keys.\r\n\r\nThere are much more clever ways to perform this attack than how I implemented it in this tool. But as I said, this tool wasn't written so that kids go around breaking into their neighbors' BTHHs, but rather as a proof of concept that it's possible (thanks to Kevin Devine's RE work ultimately).\r\n\r\nThere are guys who successfully ported the tool to work on Windows systems (see comments on this page for more info). Hope this helps!"
  },
  {
    "author": "Crashover",
    "avatar": "24f7e4f4307acb944694615405be7cf7",
    "date": "2009-04-05T19:17:33.000Z",
    "content": "when is the BTHomehub v 2.0 algorithm coming out"
  },
  {
    "author": "A N Other",
    "avatar": "4f537b2ca806d4b80c484a381d7d268a",
    "date": "2009-04-10T01:21:19.000Z",
    "content": "Hi, I've notice that this vulnerability is discussed about other ISP provided modems.\r\n\r\nhttp://packetstorm.orion-hosting.co.uk/filedesc/pirelli-vuln.pdf.html"
  },
  {
    "author": "pagvac",
    "avatar": "0367b81839d31a5fa3d7bea79ef71b9e",
    "date": "2009-04-13T17:20:32.000Z",
    "content": "@Crashover: why don't you give it a try, to see if you can figure out the algorithm for BTHH v2 :) . We'd love to publish your findings on GNUCITIZEN!\r\n\r\n@A N Other: correct! There are MANY ISPs out there shipping broadband routers whose default wifi encryption key can be predicted."
  },
  {
    "author": "Tension",
    "avatar": "88f9c2069b51a68ccad3c25346e28048",
    "date": "2009-04-15T12:24:10.000Z",
    "content": "The links for the XP version are dead.  Could someone point me in the right direction. Cheers guys!!"
  },
  {
    "author": "MaNii",
    "avatar": "296ac594b6088b6f862a77e011cdd51d",
    "date": "2009-04-16T16:35:40.000Z",
    "content": "same here ..the link for bthkeybf.zip for winXP is dead ..can anyone please update them\r\n\r\nthanks"
  },
  {
    "author": "MaNii",
    "avatar": "296ac594b6088b6f862a77e011cdd51d",
    "date": "2009-04-22T20:14:48.000Z",
    "content": "just out of curiosity ..any possibilities of determining the serial number of the bthomehub router from its default wep key?!"
  },
  {
    "author": "Miss-P",
    "avatar": "f6f1ea04d3a7ba18e7faef6c37f7f059",
    "date": "2009-04-29T14:26:06.000Z",
    "content": "Can someone help me crack the bthomehub-35bc?"
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2009-04-29T23:53:58.000Z",
    "content": "I just want to remind you that this is not a bulletin board. :)"
  },
  {
    "author": "Sly1",
    "avatar": "6fef5e1468542a1f5aa00231c5d4ed8c",
    "date": "2009-05-03T17:26:33.000Z",
    "content": "would love it if someone uploaded a new link for the winxp version"
  },
  {
    "author": "Whiplash",
    "avatar": "9e0564205e6dafa06d2307a14a9053a3",
    "date": "2009-05-04T18:30:45.000Z",
    "content": "Hi, Can someone please post where i can download a new \"stkeys\" that will do years 2005-2009!!!\r\n\r\nMany Thank\r\n\r\nP.S. and a good step by step on how to hack a BT HomeHub"
  },
  {
    "author": "mIke Portugal",
    "avatar": "31d763f0c96774c985c2d18cce56520d",
    "date": "2009-05-04T20:41:11.000Z",
    "content": "Thanks to the guys that publish this! this is very usefull, mainly in portugal, everywhere u can find a Speedtouch router :D\n\n\"the default SSID: SpeedTouchF8A3D0.\n\nThe first 5 bytes are converted to a 10 byte string which becomes the default WEP/WPA key: <code>742DA831D2</code>\n\ni would like to know, how that 5 bytes(<code>F8A3D</code>) are converted to a 10 byte string(<code>742DA831D2</code>)??\n\ncan i convert it by using a paper and pencil? :P"
  },
  {
    "author": "lorant",
    "avatar": "fb4987862b055a521888496d5583b831",
    "date": "2009-05-18T19:59:14.000Z",
    "content": "Thank's for your hard job. The new stkey it is working greate,but can somebody uploadeit???\r\nPLS!!!"
  },
  {
    "author": "Seketh",
    "avatar": "928b9ccaa45780205832ad7177898584",
    "date": "2009-05-19T17:31:39.000Z",
    "content": "So, how can I update stkeys exe to work like the stkeys posted here: http://www.righttooffend.com/stkeys.php"
  },
  {
    "author": "Nuno",
    "avatar": "ecd239baae718be1ee660ed72cb438fc",
    "date": "2009-05-21T15:53:45.000Z",
    "content": "when is avaiable to Fast (Sagem)and dlink's a tool like this? this tool for thomson's is very useful =)"
  },
  {
    "author": "jduartedj",
    "avatar": "1a9472d50fb9e5c3f4b28edeb1f61398",
    "date": "2009-06-09T12:12:39.000Z",
    "content": "Works for portugal devices (MEO ISP): http://www.nickkusters.com/SpeedTouch.aspx and probably all others too. i found a german speedtouch.exe that didn't work with the same Hex as i use on the page above. could anyone Post a link to a good stkeys file or at least the code for the algorithm! it seems easy but it's easier if it's already done!"
  },
  {
    "author": "BoBiDiGiTaL",
    "avatar": "bdd0ecb74b479d1c2af6b2dbb6143547",
    "date": "2009-06-16T15:56:18.000Z",
    "content": "this is one hell of a interesting board!\r\n\r\nThanks to all involved in the great work you have done here :)\r\n\r\nI have afew question. im using Vista and used the BTHHkeybfvista.vbs to attempt the hack, successfully generated about 72 keys but unfortunately was unable to get it cracked. what i would like to know is what software i need to  recompile/amend the source code so i can include more years and ALSO to adjust the timeout when attempting the connection."
  },
  {
    "author": "BoBiDiGiTaL",
    "avatar": "bdd0ecb74b479d1c2af6b2dbb6143547",
    "date": "2009-06-16T16:00:52.000Z",
    "content": "just to also add, i used the modified version of STKEYS located here in Spanish \r\n\r\n( http://foro.seguridadwireless.net/universo-wireless/routers-thomson-caso-espanol-redes-wepwpa-speedtouchxxxxxx-al-descubierto/80/?PHPSESSID=57a9589e4a5b32f4416673c58f7e4d59 ) \r\n\r\nto generate keys for the missing years but to my shock it produced a txt file 130MB in size, thousands of keys......."
  },
  {
    "author": "empi",
    "avatar": "f5d100a560b4f1bcab164b1fd5bcfac3",
    "date": "2009-06-22T08:43:07.000Z",
    "content": "Great tool guys. The stkeys.c program is a cool one. Helped me to stay online on vacation :-)"
  },
  {
    "author": "Goosen",
    "avatar": "9758633e02744d6059438eb7082cdeb8",
    "date": "2009-06-28T11:06:30.000Z",
    "content": "Hey guys! This tool is great...Thanks all for developing it! Now I have a request... How about the same program but for pocket pc/window mobile? That would be great! If anyone with skills could do it I beleive many people would thnak you...again!\r\n\r\nCheers,\r\nGoosen"
  },
  {
    "author": "MadComm",
    "avatar": "8d30201be47c2675597ea1f2c03e2de7",
    "date": "2009-07-24T11:49:46.000Z",
    "content": "@pagvac &amp; kevin devine;\r\n\r\n1st off all, i would like to thanx for this amazing work to both, @ kevin for this wonderful breakthrough, and @ pagvac, for all the support given here and also for the file you uploaded (interesting info :)), and 2nd I would like to make a couple of questions to you guys..\r\n\r\n1st I'd like to know if there is a win script with 2009 support keygen available for download..\r\n\r\nAnd 2nd, i've read here that this is possible to get the sky netgear default keys too, correct? I'd like to know if this would also be possible in netgear cable modem.. I think it is, although the SSID changes from 6 to 4 serial digits...\r\nI can sent you several routers tables of mac, ssid, cp, serial and keys if u want to try to reverse engineer it.\r\n\r\nThanx in advance!..\r\n\r\nCumps."
  },
  {
    "author": "boog",
    "avatar": "f7f14121e3ca595959bc5b4f361b6d1a",
    "date": "2009-07-27T09:08:08.000Z",
    "content": "http://www.righttooffend.com/stkeys.php\r\n\r\nDoesn't work and claims to log IP's !"
  },
  {
    "author": "Stanley",
    "avatar": "12207a7bdb49ebdb238ccd91d8d59aa1",
    "date": "2009-07-27T12:47:56.000Z",
    "content": "I've been looking for a way to gain access to the algorithm used to calculate \"MODEM_ACCESS_CODE\". It seems to be a CRC of routers MAC address. The problem is, i don't know what polynomial they used and I lack skills at dissembler. Maybe someone can figure this out...\n\nSimilar algorithm was used for old Alcatel home hub series. The router gave you challenge-response code \"Speedtouch (00:00:00:00:00:)\" when logged into telnet and by using Tsutomu Shimomura algorithm, you could easily calculate the passphrase. CGI version of this algorithm: http://security.sdsc.edu/self-help/alcatel/challenge.cgi Source file & executable of this algorithm: http://www.petri.co.il/downloads/crc.zip\n\nLooking at stinstall.exe with a dissembler (CRC string):\n\n<pre><code>0045931D  |. 68 F8B35600    PUSH stInstal.0056B3F8                       ;  ASCII \"CRC: 0x%1\n\"\n00459322  |. FFD3           CALL EBX\n00459324  |. 8BC8           MOV ECX,EAX\n00459326  |. FF15 581C4900  CALL DWORD PTR DS:[;  qt-mt332.?arg@QString@@QBE?AV1@KHH@Z\n0045932C  |. 8BC8           MOV ECX,EAX\n0045932E  |. FF15 6C274900  CALL DWORD PTR DS:[;  qt-mt332.?rightJustify@QString@@QBE?AV1@IVQChar@@_N@Z\n00459334  |. 50             PUSH EAX\n00459335  |. 8D4D FC        LEA ECX,DWORD PTR SS:[EBP-4]\n00459338  |. FFD6           CALL ESI\n0045933A  |. 8D4D F0        LEA ECX,DWORD PTR SS:[EBP-10]\n0045933D  |. FF15 0C2E4900  CALL DWORD PTR DS:[;  qt-mt332.??1QString@@QAE@XZ\n00459343  |. 8D4D F4        LEA ECX,DWORD PTR SS:[EBP-C]\n00459346  |. FF15 0C2E4900  CALL DWORD PTR DS:[;  qt-mt332.??1QString@@QAE@XZ\n0045934C  |. 8D4D F8        LEA ECX,DWORD PTR SS:[EBP-8]\n0045934F  |. FF15 0C2E4900  CALL DWORD PTR DS:[;  qt-mt332.??1QString@@QAE@XZ\n00459355  |. 68 54A85600    PUSH stInstal.0056A854                       ;  ASCII \"\n\"\n0045935A  |. 8D47 38        LEA EAX,DWORD PTR DS:[EDI+38]\n0045935D  |. 50             PUSH EAX</code></pre>"
  },
  {
    "author": "vortex",
    "avatar": "151aa5852da77e782a5ec02fcb904bc1",
    "date": "2009-08-06T06:26:16.000Z",
    "content": "@Stanley\n\nI'm open to correction,but I don't believe the stinstall.exe file has a CRC routine in it. Here is my own ST 585v6 after logging in with telnet.\n\n\n<pre><code>Username :\n------------------------------------------------------------------------\n\n\n\n        OOOOOOOOOOOOOOOOOOOOOOOOOOO\n        OOOOOOOOOOOOOOOOOOOOOOOOOOOO\n        OOO                       OOO\n        OOO                        OOO  SpeedTouch 585\n        OOO   WWW    WWW    WWW    OOO\n        OOO   WWW    WWW    WWW    OOO  5.3.3.4\n        OOO   WWW    WWW    WWW    OOO\n        OOO   WWW    WWW    WWW    OOO  Copyright (c) 1999-2005, THOMSON\n        OOO   WWW    WWW    WWW    OOO\n        OOO   WWW    WWW    WWW    OOO\n        OOO   WWW    WWW    WWW    OOO\n        OOO   WWWWWWWWWWWWWWWWW    OOO\n        OOO    WWWWWWWWWWWWWWW     OOO\n        OOO                        OOO\n        OOO                        OOO\n        OOOOOOOOOOOOOOOOOOOOOOOOOOOOO\n         OOOOOOOOOOOOOOOOOOOOOOOOOOO\n\nW=>debug\n[debug]=>exec\n\n=====================DISCLAIMER======================\n Access to expert commands is intended for qualified\n personnel only.\n==================END=OF=DISCLAIMER==================\n\ncmd =</code></pre>\n\nas you can see, it doesn't ask for a password when entering expert commands, so I'm guessing the MODEM_ACCESS_CODE may indeed use a different polynomial from the alcatel routers\n\nThe only way you might find it is by reversing the firmware itself or perhaps a brute force of the CRC value."
  },
  {
    "author": "MadComm",
    "avatar": "8d30201be47c2675597ea1f2c03e2de7",
    "date": "2009-08-10T19:32:26.000Z",
    "content": "@ stanley..\nI'm sorry, but i really didn't get what you're looking into (maybe 'cause i'm portuguese)... Anyway, if u want acess to the router, with superuser, or even root privileges, here's a really easy way to do it: http://speedtouch.blog.hr/ hope it helps!..\n\nCan anyone comment on my previous post? it would be helpfull..\n\nCumps!"
  },
  {
    "author": "vortex",
    "avatar": "151aa5852da77e782a5ec02fcb904bc1",
    "date": "2009-08-11T11:17:02.000Z",
    "content": "@MadComm\n\nDon't know anything about the netgear sky routers, but apparently james67 who reverse engineered it won't release details of the algorithm. Your best bet is to try debug the router firmware, through JTAG interface. Most routers have a JTAG interface for debugging purposes."
  },
  {
    "author": "MadComm",
    "avatar": "8d30201be47c2675597ea1f2c03e2de7",
    "date": "2009-08-20T19:15:13.000Z",
    "content": "@ vortex:\n\n1st off all, thanx for the reply mate, you were the only one who bothered to reply and address the issue in hand.. unfortunately i'm too noob, even to understand assembly (usual FW language). But i had other idea for maybe a easier way to do it.. i can get a bunch of routers to take the necessary info (serial, mac, CP serial, ssid, wpa default key, and all the info on the back sticker), do you think we can to reverse engineer the wpa key based on this info? according to james67 we only need mac and serial..\nthanx!"
  },
  {
    "author": "tomashavenger",
    "avatar": "c790af882f6edebac19ac27b44c826d7",
    "date": "2009-08-30T06:46:37.000Z",
    "content": "I wonder when the bthomhub v 2.0 algorithim will come I've tried to crack it and had no such luck"
  },
  {
    "author": "fLaSh",
    "avatar": "ffcea88b105521428e0fc584bd121bdc",
    "date": "2009-09-11T20:55:21.000Z",
    "content": "New STKeys for Windows Mobile users! http://flash.i.ph/blogs/flash/2009/09/12/default-key-algorithm-in-thomson-most-popular-dsl-router-in-the-pt-meo/\n\nFree and open source ;)"
  },
  {
    "author": "manuel",
    "avatar": "fd886c0d221cfa6747d8b60d1100d1a9",
    "date": "2009-09-22T12:37:53.000Z",
    "content": "That's cool, i wonder if it is possible to make stkeys work on the iphone/ipod touch"
  },
  {
    "author": "bennie",
    "avatar": "70b13b3cf1ffb32bfd03935373367f51",
    "date": "2009-09-29T16:46:53.000Z",
    "content": "the bthhkeybf.vbs link is not working :("
  },
  {
    "author": "Simon",
    "avatar": "aff482679d294d0959aa872233548643",
    "date": "2009-10-04T08:35:54.000Z",
    "content": "Anyone know where I can get a copy of the script which trys the keys in the dictionary, I searched high and low (ok.... on google) but no joy!!!  I am guessing loads of people have this... any care to upload a link?\r\n\r\nAppreciate it.... I can share a Sky V2 concept as a repayment!!"
  },
  {
    "author": "Martin",
    "avatar": "d5459eb38f6fb7612b71bb44ee71b7b1",
    "date": "2009-10-11T17:10:53.000Z",
    "content": "hi, can anyone help me with BTHHkeybf.zip file. i need bthhkeybf.vbs and can't find it anywhere.\n\nMartin"
  },
  {
    "author": "FILIPE",
    "avatar": "b745b2c3638ad4d8dfad504752b79c7a",
    "date": "2009-10-12T15:19:18.000Z",
    "content": "can you find the WPA key of 34458F"
  },
  {
    "author": "Edward P",
    "avatar": "9fb0dccdb63d79f445b757928a33fdc4",
    "date": "2009-10-14T08:33:26.000Z",
    "content": "http://www.voidrage.com/BTHHkeybf.rar\r\n\r\nFor those who need it ^^"
  },
  {
    "author": "darkwader",
    "avatar": "56ae2ddfa52bf64ba4e261751d6c5231",
    "date": "2009-10-15T14:23:31.000Z",
    "content": "I have ISP password stored in my SpeedTouch 780WL config file and it's encrypted: <code>_DEV_252E8E68835B5C9B</code>\n\nDoes anyone know how I can decrypt this password,someone said that it's hashed by serial number of modem or mac address..Does anyone know any info about this and how I can decrypt it.."
  },
  {
    "author": "Dynamitesoul",
    "avatar": "97d32ffc76ab86a5d1be2b6530aeb3e4",
    "date": "2009-10-17T11:23:37.000Z",
    "content": "Completely new at this but need help with the file adrian posted...how do i go about writing the file into a command line bthh_wep_keygen.inc and the bthh-keys..can this be done with windows xp command prompt or is it based on using linux. A guide on how to use those file would be really greatful...thanks in advance"
  },
  {
    "author": "Joseph",
    "avatar": "1c706553cd858086f5421b37c34437cf",
    "date": "2009-10-21T18:22:26.000Z",
    "content": "Hey guys!( 1st of all sorry for my bad english ) thanks for sharing all this information  :) i was wonder if someone can figure out if there is any connection  from this data . Is a sagem fast 1500 wg provide to me by otenet .\n\n<pre><code>S/N: 2806318EP010155  ( this is the serial number from the label under the router )\nSSID: OTENET_7686\nWEPKEY: A3942C1252FC37CDCF97B8BED8 ( the default key ) \nAdmin Password: hrdh7736</code></pre>\n\nThis info is from the web-interface of the router \n\n<pre><code>Runtime Code Version:  \t F@st 1500WG SP Ver. 3.0.6.c (Jun 13 2007 09:51:07)\nBoot Code Version: \t 0.73.3\nADSL Modem Code Version: 06.00.02.00A\nSerial Num: \t\t J630029946\nHardware Version: \t 01\nLAN MAC Address: \t 00-15-56-B7-5E-82\nWireless MAC Address:\t 00-15-56-B7-5E-84\nWAN MAC Address: \t 00-15-56-B7-5E-83</code></pre>\n\ni mention that,  i update  the frimware of my router"
  },
  {
    "author": "Tim889",
    "avatar": "2209611f299d108b10313562f4d76d90",
    "date": "2009-10-26T00:00:10.000Z",
    "content": "Great topic and thanks to everyone with constructive info. Shame there is no ifo on BTHH v2 at the min, there is so many of them about now its getting hard to find the v1 and v.1.5"
  },
  {
    "author": "SirArthur",
    "avatar": "900e48026e8eaebef5e9d2c043941d37",
    "date": "2009-10-30T12:42:00.000Z",
    "content": "A simple remake of the stKeys available on this page allowing to select the last year to calculate.\n\n<pre><code>Usage: stKeys2  \nEg: stKeys2 188DBB 10\n(Search for possible keys for 188DBB made until 2010)</code></pre>\n\nhttp://www.megaupload.com/?d=4WSPGII8"
  },
  {
    "author": "gool",
    "avatar": "cdff926b4d2d5efe370bf20ae0139565",
    "date": "2009-11-13T15:22:20.000Z",
    "content": "you complied stkeys2 only for thomson router what about bthomehub? your stkeys2 dosent work with bthomehub..."
  },
  {
    "author": "David Openmind",
    "avatar": "f2e934b0efbfc7fee9f4ee62fc705f95",
    "date": "2009-11-24T22:50:03.000Z",
    "content": "Please also what is the network key all about or as that me being silly or is that just another name for the wep key ?\r\nBecause when we have selected the BtHH it the asks for the Network key?\r\n\r\nThanking you so much in advance for your kindness and help.."
  },
  {
    "author": "pranky0607",
    "avatar": "c244297f3178cca915e8ed2f94464ed7",
    "date": "2009-12-03T22:31:26.000Z",
    "content": "been playing with the Home Hub 2.0, and the WPA key appears pretty secure.  However it appears as if the default ESSID and the default WPA key comes from the Mac Code of the router.  There are 4 mac codes available but they are all in order.  \r\n\r\nThe new hubs also have an interesting levels of dgst available, which could go some way towards not being able to work it out up to now.  Anyone else had more luck on this than me?"
  },
  {
    "author": "Puffyandre",
    "avatar": "02d47d95daebe853eba7580256380407",
    "date": "2009-12-15T13:08:09.000Z",
    "content": "Edward P responds:\r\n\r\nhttp://www.voidrage.com/BTHHkeybf.rar\r\n\r\nThe file is corrupt? Anyone else getting this? I've tried downloading multiple times and using different apps to open, but still get the same result."
  },
  {
    "author": "ginjon",
    "avatar": "c8becbd5b0879ac5f676a1fc906b8959",
    "date": "2009-12-15T16:29:24.000Z",
    "content": "@gool\r\n\r\nhome hubs are thompson speed touch, they are just re branded..."
  },
  {
    "author": "sweetdue",
    "avatar": "57809a343f9cb87291dac1a85f467bfb",
    "date": "2009-12-30T14:38:03.000Z",
    "content": "Hi can you tell me if you have an update for later speedtouchs as im does not find my keys.?????"
  },
  {
    "author": "JIMR-1969",
    "avatar": "db0ae59e662708a0749b345a75742806",
    "date": "2010-01-12T03:22:14.000Z",
    "content": "Hi folks, i was wondering if you could create precomputed tables same way so we can retrieve from the mac address the serial number of the device or is it someother way where by giving the mac address of a thomson router we can compute the default ssid or at least take the serial number of the device?\r\nThank you in advance....."
  },
  {
    "author": "Andy",
    "avatar": "efb5b96b80223a1df9254c1be3fb1824",
    "date": "2010-01-20T12:36:01.000Z",
    "content": "Just a quick question.\r\n\r\nTo improve security, I would like to change the default encryption key of the Thomson router. But others who also use this router are worried about change.\r\n\r\nIf I change the password of the router alone would this be sufficient to inrease the level of security. I assume that in this case others who use the router will not have to make any changes.\r\n\r\nThanks"
  },
  {
    "author": "chris",
    "avatar": "9f0c0f24c493e637695c957fbaa36fe0",
    "date": "2010-02-09T01:05:37.000Z",
    "content": "can some make a online tool for wep keys please. like nick kuster speedtouch. please"
  },
  {
    "author": "Peter",
    "avatar": "3d4ac998cc1271e679ffa670db3d0eb6",
    "date": "2010-02-15T12:59:54.000Z",
    "content": "Can anyone can use STKEYS to make a windows mobile program (.cab) for ganerate the keys?\r\n\r\nThat gonna be more usefull on the road... :P"
  },
  {
    "author": "jamal212",
    "avatar": "eab827913ccb9b7f05494cb439d6684c",
    "date": "2010-02-18T07:44:19.000Z",
    "content": "hi can someone please find the wep code for my brothers homehub pls. Its called bthomehub-bd78. Thanks"
  },
  {
    "author": "bennie",
    "avatar": "70b13b3cf1ffb32bfd03935373367f51",
    "date": "2010-02-23T17:36:14.000Z",
    "content": "@jamal212 whats ur email"
  },
  {
    "author": "jerdam",
    "avatar": "50eb97ca105409d3843a0d5d66d13f11",
    "date": "2010-03-04T15:51:34.000Z",
    "content": "Hello guys, does anybody know how to find a original SSID from changed speedtouch router SSID? thanks"
  },
  {
    "author": "Karan",
    "avatar": "672154b17ced28d40fbbb525bf1eb6f1",
    "date": "2010-03-05T13:10:07.000Z",
    "content": "Hi every1 i have read the whole blog couple of times first of all would like to say thnx and congrats to all of u who have worked on this grt grt work ...!!\n\nbt i couldn work out how to crack it yet i have downloaded the D2T1 Adrian pastor- cracking into embeded devices and beyond ..i manged to get into a excel file with loads of keys ...bt could find my one i have one bt home network named BTHomeHub2-WR8N\n\nif any1 can help then it will be highly appriciated coz i am really in need of a internet nw thnx my email is karan_fire(at)hotmail(dot)com.\n\nCheers."
  },
  {
    "author": "Columbo",
    "avatar": "cad89979de2f9a1935985d59af42f891",
    "date": "2010-03-09T01:10:29.000Z",
    "content": "Hi. I read this, and you are good at it..smart heads... I am studying..and could any one figure it which WEP key is for this ...ThomsonFF331D\r\ntnks for reading...."
  },
  {
    "author": "jim",
    "avatar": "048ab90b8263566ffafe08c34ee956e9",
    "date": "2010-03-24T05:37:38.000Z",
    "content": "@Columbo Try CP08254A4E51"
  },
  {
    "author": "Alex",
    "avatar": "42ce2872569de3a65f8515f582bc91eb",
    "date": "2010-04-08T21:21:00.000Z",
    "content": "Its possible to find WPA/WEP from MAC Adress if i Dont know last digits after \"ThomsonXXXX\" but i KNOW a MAC adress. Its very urgent for me."
  },
  {
    "author": "John",
    "avatar": "0b6a4e418938d945eeefedb32210d4f8",
    "date": "2010-04-19T17:41:01.000Z",
    "content": "Maybe people want a gui, written in python for dlink and thomson ;) http://code.google.com/p/wifipassreminder/"
  },
  {
    "author": "joseph",
    "avatar": "792d9fd90f26628b6e8eb3de43d1f65d",
    "date": "2010-04-27T06:12:28.000Z",
    "content": "@chris online tool like nick  kuster https://amigdalo.ath.cx/joseph/projects/ST/"
  },
  {
    "author": "erjon",
    "avatar": "23d682e745d286e54f0e52b1375f5a71",
    "date": "2010-04-28T00:09:19.000Z",
    "content": "for this tomsonFF331D  key is <code>8B55069C0C</code> or <code>FF5715166E</code>"
  },
  {
    "author": "Bogdan",
    "avatar": "836aab5c45037479345dc37324d80a1f",
    "date": "2010-05-01T12:28:14.000Z",
    "content": "Hello,\nDoes anyone have the winxp tool or any other tool to generate the WEP key without an internet connection ? None of the links up there work, besides this one: http://www.nickkusters.com/SpeedTouch.aspx\n\nThank you."
  },
  {
    "author": "NOKIAS",
    "avatar": "2e0c406bcfa3f98727720823ccf4412d",
    "date": "2010-05-31T22:11:55.000Z",
    "content": "I'm having problems with the new 2010 thomson routers that stkeys cant calc or calcs it wrong! Is there solution for this?"
  },
  {
    "author": "os os",
    "avatar": "137117e192359c9cd4046bd907ec1b97",
    "date": "2010-06-06T09:16:07.000Z",
    "content": "You guys r very genius. I wonder if anyone can tell me how can I get through the set up of thomson585 if I lost the user name and the password. Many thanks in advancOsama"
  },
  {
    "author": "V2k",
    "avatar": "2d4667381b9c5a85d515c74ce08d307c",
    "date": "2010-06-06T18:34:33.000Z",
    "content": "I was wondering whilst reading this page if you can help explain the example:\n\n<pre><code>S/N: CP0647EH6DM(BF)\nRemove CC and PP values: CP06476DM\n\"XXX\" values hex-encoded: CP064736444D\nSHA1-ed: 06f48a28eba1ab896a396077d772fd65503b8df3\nDefault SSID: BTHomeHub-8DF3\nDefault encryption key: 06f48a28eb</code></pre>\n\n1. what are the CC,PP &amp; XXX values. I'm assuming the CC value in the example is EH and the PP value is M but that can't be right as M isn't a hex value so how was the XXX value calculated.I just don't know what the PP values are and if my assumption is correct.I can't find info online explaining this is or am I just being blonde in my searching.\n2. Using Network Stumbler I have a netgear router-secured with wpa and from what I've read you can obtain the serial number from the mac address.Is this still the case as the example i've tried only generates a 7decimal figure. From there I've used an online sha1 hash tool that gave me a hash code based on what i presume to be the serial number.  From this and your example I used the 1st 10 hexdigits to generate a code but this didn't work.\n\nSo what I'm doing is trying to understand how to obtain a serial from a mac address, what the CC &amp; PP values are and do these values reflect all network devices regardless of manufacturer.is it still possible to get hold of the stkeys as the links don't work anymore.\n\nAnyway hope I'm not being too thick but I would like to understand the process more.The last time I used hex was back in secondary school :)"
  },
  {
    "author": "Colesy",
    "avatar": "fc180dff31ba1f633f6642bba55d3858",
    "date": "2010-06-21T18:21:34.000Z",
    "content": "I've read through this whole forum regarding BTHomeHub ver2 -\n\nNo one has figured out the algorithm or have they. The posts here are dated 2008+ We are now in -6/2010 and the routers BT issue are standard BTHH ver2.0. I also believe BT have upgraded existing BTHH ver 1 user with the new versions.\n\nBTHH ver 2 has WPA-WPA2/PSK(Pre Shared Key) security Enabled.\n\nI have a BTHH v2 Router info :-\n<code>BSSID - BTHomeHub2-C5NN\nDefault WPA2 Code - 3d3534d6c4\nMAC ADDRESS - 00:24:2C:4E:72:D9</code>\n\nI hope this information is helpful to whome-ever is trying to break the most recent algorithm, if more information is required then please post back.\n\nThis post is dated 21/06/2010 @ 7:21pm"
  },
  {
    "author": "pagvac",
    "avatar": "0367b81839d31a5fa3d7bea79ef71b9e",
    "date": "2010-06-25T21:22:28.000Z",
    "content": "Hi Karan, the research you mentioned doesn't apply to BTHH's v2"
  },
  {
    "author": "Paul",
    "avatar": "af88c1a280ef132f31dbc286602a3330",
    "date": "2010-06-27T11:52:03.000Z",
    "content": "Hay can some one please let me know how to calc the wpa key for bthomehub ver1 please? its just to get me online sted of this wep!"
  },
  {
    "author": "Adrian",
    "avatar": "c2018b6fe75abd41403a68c4aa2b469e",
    "date": "2010-07-06T22:42:02.000Z",
    "content": "how I can to know a wep key with this iwep pro version.    Can you tell me?   I tried to make it, but i don't know how to"
  },
  {
    "author": "dans",
    "avatar": "d0475de87f4aaab9558b0e8857ccb635",
    "date": "2010-07-16T00:24:31.000Z",
    "content": "Hi, I've noticed there are new routers for which this does not work... Is there any alternative algorithm for those routers (eg C36CBA)?\n\nThanks,\ndans"
  },
  {
    "author": "Rui",
    "avatar": "ede887084162ba19e7efb26352760b1a",
    "date": "2010-07-23T18:17:24.000Z",
    "content": "Columbo = <code>8B55069C0C</code> That's your pass ;)"
  },
  {
    "author": "Closis",
    "avatar": "6eb4034769b96dec74f7f2342cda9674",
    "date": "2010-07-24T12:31:27.000Z",
    "content": "Yes, seems like thomson routers have a new algorithm now, \n\nFor instance to help someone crack the new algorithm here is an example of the new 2010 routers:\n\n<code>SSID: ThomsonC329C1\nDefault WPA: C374DEA22\nSN: CP0947ntjr5 (b5)</code>\n\nWhen I try to calculate keys with st, even if I change the limit to 2011 the new key C374DEA22 don't appear..."
  },
  {
    "author": "colesy",
    "avatar": "ad3d0eb7610392259e113281eb985d48",
    "date": "2010-08-11T13:05:19.000Z",
    "content": "Why does this research not apply?"
  },
  {
    "author": "roo",
    "avatar": "e4a3190099875b092c67319287645892",
    "date": "2010-08-24T04:32:27.000Z",
    "content": "@closis From the s/n you provided, the old algorithm calculates your key to be \"CE74DE1A22\".  This is pretty close to your posted suggestion of \"C374DEA22\"... can you doublecheck that please?\nAlso can you post your MAC please.\n\n@colesy Can you post your s/n please?\n\n@'broadcast' I just got issued a new speedtouch (sn CP1019...).  The default wpa key is calculated correctly from the sn, but the ssid appears to be derived from the last 3 octets of the mac.  \nI have a hunch that there could possibly be a link between the mac and the serial along the lines of the pirelli DRG A225 disclosed by Muris Kurgas (http://packetstorm.orion-hosting.co.uk/filedesc/pirelli-vuln.pdf.html)"
  },
  {
    "author": "Sam",
    "avatar": "2607a1f719303ac7118903a8d7fc03b9",
    "date": "2010-09-02T16:47:52.000Z",
    "content": "does anyone have BTHHkeybf for window XP????"
  },
  {
    "author": "André",
    "avatar": "d66786fc203c6572f5723c4d14f320ca",
    "date": "2010-09-03T19:38:24.000Z",
    "content": "Great Work ppl! But the stkeys link is down... Can't you upload plz. I want the source code too :)\nThanks"
  },
  {
    "author": "AP",
    "avatar": "d7ba700e66ef61e51bf828d0612f0c85",
    "date": "2010-09-22T07:45:50.000Z",
    "content": "Consider the following Speedtouch AP\n\n<pre><code>CP0815SF2PB(80)\nSSID Thomson9c726a\nWPA BBA72BD067</code></pre>\n\nNow take the CP0815 and change the XXX to ASCII. That is change 2PB to ASCII = 325042\n\nSHA-1 CP0815325042 is bba72bd067e6cb5b9f21707b547cfd1bf79c726a.\n\nThe first 10 characters is the WPA key and the last 6 characters is the SSID.\n\nHowever if we use the 9c726a is the program that cracks the codes it says that nothing is found. Therefore is there something wrong with the application? Is it not meant to work with letters above F. In this case there is a P character."
  },
  {
    "author": "paok",
    "avatar": "9f32cf90af4973ee7248f2d9e71a64e5",
    "date": "2010-09-25T19:11:03.000Z",
    "content": "does anyone know the wpa-psk key for thomson521BE2?"
  },
  {
    "author": "Jonny",
    "avatar": "ebafa84d85bac9ad167d8353032935a8",
    "date": "2010-09-28T18:01:53.000Z",
    "content": "Wow... sounds amazing and far too complicating for me... Then.. what would the key be for BTHomeHub-9236?.."
  },
  {
    "author": "@paok",
    "avatar": "d8ffeba65ee5baf57e4901690edc8e1b",
    "date": "2010-10-10T00:47:22.000Z",
    "content": "@paok 21255FBAF0"
  },
  {
    "author": "Queen",
    "avatar": "9228468fc67db521f1aa5e29345aa06d",
    "date": "2010-10-27T10:35:02.000Z",
    "content": "Best aplication. Link: http://hotfile.com/dl/78429275/b639bfa/Find_Wifi_Key.rar.html"
  },
  {
    "author": "james",
    "avatar": "9ecbf53c34a2811326e9044dd63ab047",
    "date": "2010-10-29T22:43:35.000Z",
    "content": "is it possible to find the wep for orange906A02 i would be happy to get accsess\n\nthanks"
  },
  {
    "author": "md5this",
    "avatar": "efa1003823c5e6af802e71185f6342d2",
    "date": "2010-11-04T20:54:49.000Z",
    "content": "paokara ela: thomson521BE2 resolves to: 21255FBAF0 reversed on: http://www.md5this.com/speedtoucher/speedtouchIT.html"
  },
  {
    "author": "fadi",
    "avatar": "a8b4126a6a62faca8b4d142faf809edd",
    "date": "2011-01-10T21:42:16.000Z",
    "content": "fastweb-1-38229dfb513c"
  },
  {
    "author": "ck",
    "avatar": "4d293e6b886facc7ee3031b33c02cf91",
    "date": "2011-01-17T14:11:53.000Z",
    "content": "To change ur  SSID Name n security type from WEP TO WPA2-PSK visit diz blog http://cklyf.blogspot.com"
  },
  {
    "author": "David",
    "avatar": "ea8293fda446fee8ceaac8a3edd272dd",
    "date": "2011-01-29T05:28:39.000Z",
    "content": "I was wondering if it's possible to do the same with only 4 digits.\r\n\r\nFor example here in Australia, Bigpond use the SpeedTouch modems and I have seen BIGPONDXXXXXX for example, but what about BIGPONDXXXX (with only 4)\r\n\r\nHow would I get the list of possible keys for the SSID BIGPOND004D?\r\n\r\nThanks in advance!"
  },
  {
    "author": "rony fadel",
    "avatar": "728d597b6e7e6813b9bc10f954ca2293",
    "date": "2011-02-22T16:52:44.000Z",
    "content": "I've made a PHP script, check it out at http://ronyfadel.com/keys.php"
  },
  {
    "author": "name",
    "avatar": "945b7be4b6a690f4db9264ff3d48ab08",
    "date": "2011-07-04T01:18:48.000Z",
    "content": "Have fun trying to find out the NEW ALGORITHM used in Thomson routers.\r\n\r\nALL THE INFO HERE\r\n\r\nhttp://pastebin.com/fNB4LTGH"
  },
  {
    "author": "lefteris",
    "avatar": "515999b8934c9ec1606bb7dae75f9742",
    "date": "2011-07-18T02:40:46.000Z",
    "content": "I created a windows version (with graphical user interface)\r\n\r\ndownloads + screenshot from:\r\n\r\nhttp://www.doc.ic.ac.uk/~ee410/thomson/"
  },
  {
    "author": "thehog",
    "avatar": "92a5db0a096bdbd9cbd2702a891737a5",
    "date": "2011-08-11T00:13:52.000Z",
    "content": "what can i say here simply impressive stuff great works"
  },
  {
    "author": "Pass!ngBy",
    "avatar": "f2d6c66424a8bcebff1040c2c365f8c9",
    "date": "2011-09-20T06:00:40.000Z",
    "content": "some claim, on blogs and articles, that by using ONLY the XXXXXX characters you can do reverse calculations to obtain the password? without the need to know the S/N , if am not wrong stkey and md5 site, locates the S/N of the XXXXXX specified router from the database then do the hashes to locate the password, am i right or they were right all that you need is the XXXXXX characters and voila!"
  },
  {
    "author": "Montana",
    "avatar": "809a9d9fb24e9e7231434841513ce3cc",
    "date": "2011-09-30T13:44:13.000Z",
    "content": "Hey is there a tool like stkeys2.exe for BTHome? I mean an honest to goodness win32 executable, like BTkeys.exe for instance? I didn't find anything of use in Adrian Pastors zip file."
  },
  {
    "author": "Anto",
    "avatar": "98f85b4030b4059c0dd629e7fffe3957",
    "date": "2011-11-28T22:55:52.000Z",
    "content": "What about BT Home Hub 2.0? Anybody has any clue how the key is generated?"
  },
  {
    "author": "akilez",
    "avatar": "ad42c64b2abcf1b27fe1382139e99b2a",
    "date": "2012-01-30T21:26:53.000Z",
    "content": "Does not work for the modem / router TG585 v8, soft. 8.6.E.9 version."
  },
  {
    "author": "kev",
    "avatar": "151aa5852da77e782a5ec02fcb904bc1",
    "date": "2012-02-12T00:11:22.000Z",
    "content": "New algorithm has been documented but no recovery tool is available due to the complexity and time required to crack key. BT and Technicolor are already aware of the problem. You can look at code here:\n\nhttp://www.woofiles.com/dl-284800-JI5f1Jyv-stkeygen.tar.gz\n\nFeel free to mirror providing code is unmodified.\n\nSHA-256 signature = 8dff6225783328c9516c0eb42f6ceab5624ded3f85ab0a94d91fb81ecabdd91c"
  },
  {
    "author": "kev",
    "avatar": "151aa5852da77e782a5ec02fcb904bc1",
    "date": "2012-02-12T14:43:35.000Z",
    "content": "file in above link was removed\r\n\r\nhttp://www.mediafire.com/?l2d57it4dkt6hso"
  },
  {
    "author": "David",
    "avatar": "2c0bd2c1fd8f4f7c3625390df2a8ffd2",
    "date": "2012-02-14T20:44:50.000Z",
    "content": "Did BT sort this out, or are the hubs still vulnerable to these attacks?"
  },
  {
    "author": "kev",
    "avatar": "151aa5852da77e782a5ec02fcb904bc1",
    "date": "2012-02-28T04:31:05.000Z",
    "content": "http://weiss.u40.hosting.digiweb.ie/stech/stkeygen.tar.gz"
  },
  {
    "author": "matt",
    "avatar": "b4c2fb5c6b8ea14498f7e5f0650a108d",
    "date": "2012-05-15T11:19:21.000Z",
    "content": "dose this work with backtrack 5 and bthomehub2?"
  },
  {
    "author": "saad",
    "avatar": "747386042482d2b12fe98030fc92853c",
    "date": "2013-01-07T02:48:42.000Z",
    "content": "Is there any method to find the default key for a Thom_Dxxxxxx ssid."
  }
]