[
  {
    "author": "Dfcnvt",
    "avatar": "89d4328a0bae76d13017a840f9448096",
    "date": "2007-06-26T21:58:55.000Z",
    "content": "Does this means that each protocol will come with a different speed/bauds? Let's say a webserver will come with a medium speed and the video stream of different protocol will come with a maxium speed? Is that what 'Net Neutrality' issue is all about?"
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2007-06-26T22:07:14.000Z",
    "content": "nope, it is all about big companies controlling the web as we know it today. The net is not like TV or Radio, where the content is meticulously selected and quite well censored. The Web is free for all of us. Everyone has the potentials to become opinion former/maker. This is exactly what big media corporations don't like."
  },
  {
    "author": "kuza55",
    "avatar": "2f6303f9095f59c14c3097ef4df566f5",
    "date": "2007-06-27T05:11:15.000Z",
    "content": "Interesting video. I saw quite a few articles/etc in net neutrality last year, and this is how I've come to see it:\r\n\r\nNet Neutrality exists, and needs to exist because we do not trust large organisations to act in the public interest. And rightly so, since they have done nothing to gain our trust.\r\n\r\nAnd that's not going to change, and so it needs to stay regulated. Or at least that's my view. Not that I have any say in it, since its a US law.\r\n\r\nOh, and why does inventing something automatically make a person's opinion important? Sure, they created something, people liked it and developed things around the idea, but I my view that doesn't make their opinion any more valid than anyone else's."
  },
  {
    "author": "pdp",
    "avatar": "711f58b095c5a8b45419d3e94df1129e",
    "date": "2007-06-27T08:30:31.000Z",
    "content": "kuza55,\r\n\r\n<blockquote>Sure, they created something, people liked it and developed things around the idea, but I my view that doesn’t make their opinion any more valid than anyone else’s.</blockquote>\r\n\r\nI agree, however, call it perception management. If you are the one who came up with the idea first, you will be considered as the most trusted information source about anything related to it."
  },
  {
    "author": "kuza55",
    "avatar": "2f6303f9095f59c14c3097ef4df566f5",
    "date": "2007-06-27T11:23:05.000Z",
    "content": "<blockquote>I agree, however, call it perception management. If you are the one who came up with the idea first, you will be considered as the most trusted information source about anything related to it.</blockquote>\r\n\r\nOk, good, I'm not crazy then; it just irks me how we have all these inventors and other people voicing their opinion on \"how things should be\", etc."
  },
  {
    "author": "pdp",
    "avatar": "711f58b095c5a8b45419d3e94df1129e",
    "date": "2007-06-27T11:35:29.000Z",
    "content": "well, it irks most of us, but this is how it should be. if you are one of these inventors/opinion formers/makers, you will have a completely different point of view on the matter, I guess."
  },
  {
    "author": "kuza55",
    "avatar": "2f6303f9095f59c14c3097ef4df566f5",
    "date": "2007-06-28T03:15:19.000Z",
    "content": "Oh, I just found this: http://arstechnica.com/news.ars/post/20070627-ftc-shoots-down-net-neutrality-says-it-is-not-needed.html And thought you'd be interested."
  }
]