[
  {
    "author": "Craig Balding",
    "avatar": "a19e8891a71af4e5e1a8a71ae63b46cb",
    "date": "2008-06-19T08:06:39.000Z",
    "content": "Hi pdp\r\n\r\nThanks for your blog - I read it on and off and find it useful.\r\n\r\nYou're right to suggest that SaaS concentrates customer data and access in one logical system via the public Internet.  In some sense SaaS does feel like it lowers the (unauthorised) barrier to entry , but on the other hand, central data stores with juicy data from multiple orgs are not new.  In the past they would have been hidden behind some kind of partner network.  But reading the recent Verizon report on breaches, partner networks feature heavily in compromises so will the SaaS approach make a real difference to breaches?\r\n\r\nMy view is that for SaaS providers, the very public nature of running a public SaaS means that intrusions are more likely to get widely reported.  Even if the SaaS provider fails to detect the intrusion, when the data gets out and gets abused all roads lead back to the SaaS provider.  \r\n\r\nWe know that orgs often fail to report breaches for fear of reputation damage (amongst other things).  Regulators now require reporting for certain categories of incident but that is limited and specific to certain industries.  However a web facing SaaS provider is now under the glare of all.  There isn't any hiding when they get 0wned.   \r\n\r\nIn the end, this may ultimately lead to either better security practices or SaaS providers requiring all customers to sign NDA's that include clauses to limit notification of breaches...\r\n\r\nThis is a good topic and its given me an idea for a future blog post :-).  Anyway, if you are interested in cloud security stuff, then check out http://cloudsecurity.org.\r\n\r\nCheers\r\n\r\nCraig"
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2008-06-19T08:50:27.000Z",
    "content": "I cannot really say whether SaaS is more secure or less secure solution. All I can say is that SaaS infrastructures are definitely more attractive to attackers. :) Also when speaking about SaaS security I must say that it very much comes down to the same concepts I have been talking about during this year.\n\n<blockquote>The security model is often shared. The security of the server depends on the security of the individual clients, while the security of the individual clients depends on the security of the server they are interacting with.</blockquote>\n\nIn a similar way, the SaaS security model is shared between itself and its clients. And we all know what too much sharing leads to."
  },
  {
    "author": "Chris Snyder",
    "avatar": "cfc32d92f1eafd2b85c3f3079407bd02",
    "date": "2008-06-19T12:11:03.000Z",
    "content": "Yeah, bravo. I find myself talking about \"attractive targets\" more and more these days, and my colleagues just look at me with blank stares. \r\n\r\nI have yet to see a fully transparent open-source, open-process SaaS company, let alone one with a proven security track record. Until that happens, I'll roll my own thank you very much.\r\n\r\nWhen you aggregate petabytes of juicy data under a single service, it is reasonable to expect that the service will be attacked, again and again. And do you think the operators will tell you when your data is compromised?"
  },
  {
    "author": "James Blake",
    "avatar": "10f367b0c4204af4b53e2301b2fa7266",
    "date": "2008-06-23T08:58:39.000Z",
    "content": "The centralisation of customer data onto a SaaS provider's infrastructure is bound to make it an attractive target.\r\n\r\nThe SaaS provider's reputation is in a large part based on the security of  customer data, which makes SaaS vendors more motivated to keep that data secure.  This is opposed to organisations themselves that store that data on-premises, where IT and infomation security primarily is not seen as a core area business.\r\n\r\nAt the same time, SaaS vendors can achieve economies of scale with regards threat mitigation, regular risk assessments and 24 x 7 incident monitoring and response.  \r\n\r\nYou could ask if email is more secure scattered across thousands of laptops in an organisation without any form of end point security as PSTs, or are they better stored in a centralised email server from which you can build some form of centralised policy and enforcement regime?  - it is the same sort of on-premise vs SaaS argument.\r\n\r\nOne of the biggest threats is SaaS vendors who are, in effect, really just hosting providers.  These vendors take off-the-shelf commercial products and then just strap several of them together with some form of management framework (billing, provisioning, etc) to form a 'solution'.  \r\n\r\nThe SaaS vendor is this situation has no control over the underlying technology, in fact they may not even truly understand it.  The several different point solutions they use often have gaps between each and the overlaid management layer adds an additional attack vector. \r\n\r\nTraditional on-premises vendors are also moving in the SaaS space, often with products that are not designed with multi-tenancy in mind - causing more potential threats.\r\n\r\nPotential buyers should look carefully at what they are buying, not all SaaS solutions are alike.  Customer should look for someone who has considered the risks of centralisation and multitenancy and then worked to mitigate them - rather than just throwing some software on a publicly accessible server and calling it SaaS.\r\n\r\nCustomer's anxieties at storing data off-site made sure that when we were designing our SaaS service we designed a distributed data store from the ground up, it was the only way we could have control over the entire lifecycle of the customer data, including its confidentiality and integrity.  \r\n\r\nYou cannot build a SaaS service that doesn't offer customers the granularity to determine their own security policy, you end up enforcing the lowest common denominator on all your customers.\r\n\r\nSaaS security is the fun challenge for the 21st century - embrace it!"
  },
  {
    "author": "Rebecca",
    "avatar": "36e8f821879fcd0eca9990e0ceb415ab",
    "date": "2008-07-03T17:23:30.000Z",
    "content": "Good post. I agree that SaaS can be somewhat sketchy in terms of security. However, you should take a look at Brick N Click from MTI. This is a retail SaaS that has industry approved security so that data is well protected. The technology also has excellent data recovery due to centralized storage. Perhaps it would interest you to attend a webinar about the technology http://www.mtiretail.com/BrickNClick.cfm?PgID=1or take a look at this page for more information and perspective. http://www.mtiretail.com/SaaS_Info.cfm"
  }
]