[
  {
    "author": "paul",
    "avatar": "388199daaf831ce73f7f68ace44874cc",
    "date": "2006-11-04T23:27:37.000Z",
    "content": "HUMPBACK, like the camel. Because the tool is for making web pages carry an extra load :)\r\n\r\nJust the first thing that came to mind. Keep up the great work."
  },
  {
    "author": "evariste",
    "avatar": "822641e51f13bc2922a263d8e43bff13",
    "date": "2006-11-05T05:38:31.000Z",
    "content": "Some ideas for a name: \r\n\r\nInsinuation\r\nPoisonDart\r\n22x55\r\nxss-dashboard\r\ncrosscript\r\nXSS/HQ"
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2006-11-05T05:39:57.000Z",
    "content": "Thanks paul, I will keep that in mind."
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2006-11-05T05:54:10.000Z",
    "content": "evariste, this is a great list. Thanks man. I wish I have more time so others can contribute as well. But definitely I will have these in mind. Here are some more:\r\n\r\nTank\r\nWEBTANK\r\nThinkTank\r\nWEBACUS\r\nInsectronix\r\nBACKFRAME\r\n\r\nThere are a few more on the list :). Thanks"
  },
  {
    "author": "MustLive",
    "avatar": "997a9fa55e557e2aa8262a07758b161d",
    "date": "2007-02-03T18:17:21.000Z",
    "content": "XSS Shell is nice (I also wrote about this program at my site), as Backweb, XSS Proxy and BEEF are.\r\n\r\nAnd about the name for your project, pdp ;-).\r\n\r\nBackweb is pretty name, but in case that you need new name, I can advise you to take BACKEND Attack Console (BACKEND) from those you said.\r\n\r\nAlso BACKFRAME is nice. As you already selected this name (I saw your article \"Backframe 2.x Sneak Preview\"). First time I thought that it is another your project, but later I read that you had to change project's name. So I also need to write at my site about new name of your project :-) (ex-Backweb)."
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2007-02-04T10:03:26.000Z",
    "content": "Thanks MustLive. Unfortunately, I need to change the name. Thanks for the suggestion, I will keep it mind for some other project."
  }
]