[
  {
    "author": "David Kierznowski",
    "avatar": "1d95d2324345e3dd2e41d6066cc1b492",
    "date": "2009-02-10T18:24:24.000Z",
    "content": "There is a currently a targetted scam in UK where the chaps phoning you already have your address and part of your bank details. \r\n\r\nIts so much easier to fall into this trap if the guys on the phone already know a fair bit about you before you even start the conversation."
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2009-02-10T22:30:24.000Z",
    "content": "absolutely!"
  },
  {
    "author": "TroyC",
    "avatar": "c3be1ad52dd098b4a37ec7c83f7add0c",
    "date": "2009-02-10T22:37:44.000Z",
    "content": "Perhaps ask the caller to send a digitally signed email.  Another option could be to provide you with a piece of your information that noone else would know.  A simple right or wrong scenario.  The caller would ask is your first three SSNs are ###?  If they are not, hang up.  If they are, proceed.  Personally I like the digitally signed email better."
  },
  {
    "author": "Shoaib Yousuf",
    "avatar": "af275b336b54b308c86ba4c164bf3b89",
    "date": "2009-02-10T23:47:22.000Z",
    "content": "Recently i was investigating a case, in which scammer sent out a Paypal phishing email to a user, user was fooled and he gave out all his details except his credit card numbers. Scammer rang the user as he got all the details from the phishing email, pretending a call from Paypal. He mentioned, we sent out you an email but unfortunately you didn't provide a valid credit card number, user thought this is legitmate call and he gave his credit card details.\r\n\r\nAfter one month, he noticed 3k fraudulent charges on this credit card plus he lost his identity.\r\n\r\nShoaib"
  },
  {
    "author": "Hugh",
    "avatar": "a6ce3ccf38b937b5c9f625072739c03f",
    "date": "2009-02-14T07:10:24.000Z",
    "content": "I concur that problem is in the process, but perhaps the best defense is to avoid the temptation of giving personal information on the phone unless you can verify the ligitimacy of the person at the other end"
  },
  {
    "author": "pagvac",
    "avatar": "0367b81839d31a5fa3d7bea79ef71b9e",
    "date": "2009-02-22T17:41:28.000Z",
    "content": "sometimes credit card DBs get compromised, but the  PANs are split across different DBs as a defense in depth mechanism. This is why in some carding forums you can only buy partial credit card #s. The reason why scammers buy them is because it allows them to perform targeted attacks where the victim feels the attacker is a legitimate entity because some info is previously known (even if that info is not complete). Think of customized phishing over email and phone."
  },
  {
    "author": "Abhinav Vaid",
    "avatar": "d4098ef7fe67f3ec7d5835cdff0d1fec",
    "date": "2009-04-04T18:55:52.000Z",
    "content": "As a rule of thumb, I think one should should never ever disclose any personal information over the phone irrespective of what the caller says/claims. The only exception could be if you've identified the no (caller id), & hence know the caller.\n\nAlthough giving ssn's or credit card numbers (especially the later one is like giving a blank cheque to a professional cheat."
  }
]