[
  {
    "author": "Giorgio Maone",
    "avatar": "290e868e00e8429bf1624a461b8ef81e",
    "date": "2007-07-25T13:07:11.000Z",
    "content": "I'm won't say anything ;)\r\nhttp://noscript.net/changelog#1.1.6.07"
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2007-07-25T13:08:24.000Z",
    "content": "good, cuz I am not saying anything either :)"
  },
  {
    "author": "Jordan",
    "avatar": "129b6f1bf6c627d5ca57779bd15ea649",
    "date": "2007-07-25T18:39:39.000Z",
    "content": "Odd -- I've been trying to test this in a base XP image, with no luck.  Does it really require SP2 to work?  That'd be kind of ironic.  Outlook Express is the default registered mail handler for mailto: on the test system I just installed into vmware.  I'm going through the upgrades now, testing it at each step to see at what point it becomes vulnerable."
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2007-07-25T18:48:50.000Z",
    "content": "Jordan, the vector does not work if you have Outlook as a default <strong>mailto:</strong> handler. If your default Mail client is Thunderbird, then you shouldn't have any problem with launching the attack. BTW, try using other protocols. It works like a charm."
  },
  {
    "author": "Jordan",
    "avatar": "129b6f1bf6c627d5ca57779bd15ea649",
    "date": "2007-07-25T19:00:42.000Z",
    "content": "pdp -- there's something else involved in the process that's disrupting it.\r\n\r\nI just grabbed all the updates for the SP2 machine, and /now/ the exploit works.  Outlook Express is still registered as the mailto handler just like it was before I grabbed the updates.  \r\n\r\nSo in short, install a standard SP2 machine.  Exploit fails.  Install latest security patches.  Exploit succeeds.  \r\n\r\nLemme verify it again and use regmon to trace the registry calls to see if I can find out what's different."
  },
  {
    "author": "Jordan",
    "avatar": "129b6f1bf6c627d5ca57779bd15ea649",
    "date": "2007-07-25T19:26:11.000Z",
    "content": "Ok, just ran it a second time after reverting the snapshot, and sure enough -- a base SP2 machine is /not/ vulnerable for some reason.  Got the regmon logs, but I don't have the time to parse through them right now.  \r\n\r\nHere's a zip with a screenshot showing the exploit fail, regmon logs of the exploit both failing and then succeeding on the same machine just with and without patches:\r\n\r\nhttp://www.psifertex.com/download/firefox-command-injection.zip\r\n\r\nMaybe someone else can figure it out while I get back to pretending to work on this other project here at my office.  ;-)"
  },
  {
    "author": "Adrian Pastor",
    "avatar": "e262088c60a66120c5cf9ab4c54a3e17",
    "date": "2007-07-25T19:28:50.000Z",
    "content": "It's very worrying how easy it is to exploit this vulnerability and how well it works.\r\n\r\nI must research these URI handler bugs!"
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2007-07-25T20:38:34.000Z",
    "content": "Jordan, again, it depends on the URL handler for the <strong>mailto:</strong> protocol.\r\n\r\nAdrian, yes, yes and yes."
  },
  {
    "author": "Jordan",
    "avatar": "129b6f1bf6c627d5ca57779bd15ea649",
    "date": "2007-07-26T01:02:18.000Z",
    "content": "pdp -- I realize that, but there's something else going on.  Check this out to see what I mean:\r\n\r\nXPSP2 with no patches + Firefox = Exploit fails\r\nXPSP2 with all patches (sans IE7) + Firefox = Exploit fails\r\nXPSP2 with all patches (including IE7) + Firefox = Exploit succeeds!\r\nXPSP2 with no patches + Firefox + Thunderbird installed and configured = Exploit fails\r\nXPSP2 with no patches except for IE7 + Firefox + Thunderbird = Exploit succeeds!\r\n\r\nI've tried other combinations besides those, and the only way I can get the exploit to succeed is if IE7 is installed.  If anyone's able to get the exploit working without IE7 installed, I'd be really curious to know."
  },
  {
    "author": "Jordan",
    "avatar": "129b6f1bf6c627d5ca57779bd15ea649",
    "date": "2007-07-26T02:31:19.000Z",
    "content": "Looks like I'm not the only person to observe that:\r\n\r\nhttps://bugzilla.mozilla.org/show_bug.cgi?id=389580#c6"
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2007-07-26T06:43:25.000Z",
    "content": "Jordan, thanks for the good research. yes, it is very interesting. Have you taken snapshots of the registry tree for each setup? because now we can detect what's the cause of it. I have some very wild guess but it is good to have some proof. cheers"
  }
]