[
  {
    "author": "palako",
    "avatar": "b494bb1a8ffb7b1eee1ad9687eee9a9e",
    "date": "2008-01-14T21:53:29.000Z",
    "content": "\"If the majority of people still don't get it after this post, then that will mean that we have failed and we shouldn't have published the research.\"\n\nI disagree. If the majority of people still don't get it, then they better go and read anywhere else. You guys have been through an excelent research and disclosure work, and I really thank you for that. I, as you do, think that this issue is highly critical. Reminds me the times when the majority of snmp devices came with \"public\" and \"private\" as the default keys. \n\nIt will take a long until this scenario changes. Normal people, not security professionals or just computer related professionals, doesn't concern about this kind of topics, so we will have to wait until the need of new devices cames out, which will came with UPnP not activated by default or with authentication added to the protocol, and the eariler that this is going to  happen is with the next network technology jump, maybe fiber at home. Not too soon, definitlely."
  },
  {
    "author": "Alex",
    "avatar": "a8d75870431d765df3c067283af3d370",
    "date": "2008-01-15T00:02:59.000Z",
    "content": "BTW: There are some routers out there, which answer on their hostname. So there's no need to know their IP-addresses. For example the routers from vendor AVM called Fritz!Box.\r\n\r\nThey will answer on: <code>ping fritz.box</code> or <code>http&#58;//fritz.box</code>"
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2008-01-15T00:07:20.000Z",
    "content": "yep, perfectly valid point. we haven't thought about it. :) BT Home Hub answers on <code>api.home</code>"
  },
  {
    "author": "Nicho",
    "avatar": "322ca83a1ca0618440c7e777b27fc97f",
    "date": "2008-01-15T09:09:14.000Z",
    "content": "A question. Reading this I'm left with the impression that pretty much all routers are vulnerable. I would've thought that only those that connect via upnp would be so. eg. My linksys broadband router has a bunch of RJ45's and I configure by pointing the browser to the preset address. In this scenario, how does the vulnerability come into play ?"
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2008-01-15T10:42:17.000Z",
    "content": "Nicho, most, if not all, routers are UPnP enabled and most of them have UPnP turned on."
  },
  {
    "author": "The Mole",
    "avatar": "ca896c213fdd33cd62c6a161b1e7bfaf",
    "date": "2008-01-15T11:16:10.000Z",
    "content": "I find it very tenious that the reason that this isn't a security flaw in flash is because flash is behaving the way it was designed too. This is complete rubbish.\r\n\r\nIt IS a security flaw in flash. I can see no justifiable circumstances why a flash script from the internet should be able to open a page to a private non-public ip address. It shouldn't be allowed."
  },
  {
    "author": "Craig Scott",
    "avatar": "964ec4c8bb8de2b45d6f6841c5f57437",
    "date": "2008-01-15T13:11:48.000Z",
    "content": "\"Yes! UPnP is turned on by default on most, if not all devices. Otherwise, things like MSN and Skype realtime audio and video, P2P (Peer-to-Peer) software like Emule, Games of all kinds and bunch of other things wont work unless the user manually make changes in their router’s configuration.\"\r\n\r\nI can't comment on the rest, but skype still works fine with UPnP disabled. It can take advantage of UPnP if enabled, but it copes fine without it."
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2008-01-15T13:19:20.000Z",
    "content": "Craig, thanks for the input. We haven't done much investigation whether Skype works with/without UPnP. All we know is that UPnP is used for many things. For example, some ISPs provide you with Wizard-like Software that help you with configuring the device. What do you think the software uses? UPnP!\r\n\r\nMany of you say that it is ok to turn UPnP off. Well, I am not sure about that. As a security guy I recommend turning UPnP off. Though, I can clearly see how this can turn into a problem. People does use it. Go explain to our grandma how to add a portforward through the admin interface so that she is secure when using whatever program she might have in mind. She would rather leave that decision to the computer, I guess. So let's not be ignorant."
  },
  {
    "author": "damien",
    "avatar": "b6f68ebad084b66ef8dcccb0bf5cebda",
    "date": "2008-01-15T13:19:29.000Z",
    "content": "routerlogin.com and routerlogin.net point to the netgear router."
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2008-01-15T13:20:43.000Z",
    "content": "damien, this proves the point that the attack will be a lot more slicker if we use names rather then bruteforcing IP addresses."
  },
  {
    "author": "Adrian Pastor",
    "avatar": "ef14ae4ef69235fa6c3709438357819d",
    "date": "2008-01-15T15:26:04.000Z",
    "content": "A classic example of a tool that allows you to configure somthing via UPnP is Slingbox. If you enable \"remote viewing\" all the configuration tool (SlingPlayer) does is enable port-forwarding on your router as we mentioned here: http://www.gnucitizen.org/blog/strategic-geoip-hacking-and-tv-streaming-theft  Think about it: SlingPlayer never asks you to enter your router's admin password!!\r\n\r\nAgain, although we don't want to repeat ourselves, UPnP does many more things than just port forwarding (especially on IGDs - aka home routers)."
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2008-01-15T15:28:44.000Z",
    "content": "and I would like to add that the Flash UPnP hack and the XSS UPnP hack can be used for other UPnP enabled devices, not just routers."
  },
  {
    "author": "Tim Cutts",
    "avatar": "393156d89094effcf156821f30dcc3cc",
    "date": "2008-01-15T18:04:35.000Z",
    "content": "I always considered UPnP to be an obvious security nightmare, and switched it off on every router I've ever owned.  Unauthenticated manipulation of the firewall rules?!  You might as well not have a firewall at all.  That alone was enough for me to switch it off.\r\n\r\nConsider the equivalent in your home - allowing any visitor to your home to change the locks or put new doors in the walls.\r\n\r\nTim"
  },
  {
    "author": "Stephen Auerbach",
    "avatar": "765603e4dd009033f0e16383f4c98148",
    "date": "2008-01-15T18:06:40.000Z",
    "content": "I hate, hate, hate white on black text. I hate hate hate white on black text. Why do people create white on black web sites? Why?"
  },
  {
    "author": "Philip Cass",
    "avatar": "8885ddfba4cd2c8dfe90c4e70fd0669e",
    "date": "2008-01-15T18:33:11.000Z",
    "content": "\"for other UPnP enabled devices, not just routers\"\r\n\r\ntrue, but it's routers that have the bloody stupid ability to have their DNS settings changed by J.Random client\r\n\r\nnot so worried about the port opening (or else why use UPnP with your router?) as I believe a computer should be secured as if connected directly to the internet... but the person who thought it was a good idea to let any computer on a LAN change central settings needs to rethink things a bit"
  },
  {
    "author": "Armijn Hemel",
    "avatar": "7a863929995ff28043b07e795eb1d9c2",
    "date": "2008-01-15T18:39:29.000Z",
    "content": "hi guys,\r\n\r\nexcellent work. I never had the time to turn my own research about UPnP (published at SANE 2006) into a websploit. You might want to know there are a lot of extra hacks possible, depending on which stack is used, including remote root exploits on the router itself. You might want to adapt your tools to do even more interesting things.\r\n\r\nSee http://www.upnp-hacks.org/ for a discussion of several UPnP stacks and their security issues."
  },
  {
    "author": "sc",
    "avatar": "f050cebfae55541fa1fd04988c7998d3",
    "date": "2008-01-15T19:20:33.000Z",
    "content": "\"Nicho, most, if not all, routers are UPnP enabled and most of them have UPnP turned on.\"\r\n\r\nFWIW, I just checked mine and UPnP is deactivated. And I'm 100% I've never touched that setting. I'm using the Sitecom Modem/Router WL-174."
  },
  {
    "author": "Anon",
    "avatar": "9d90721113b3dce28b487643bf0aeb59",
    "date": "2008-01-15T21:37:19.000Z",
    "content": "My Netgear WGR614 v6 came with UPnP off by default.  I don't know if it's enabled by default in most routers."
  },
  {
    "author": "Alan",
    "avatar": "c781b5504494c9dfe0d1514df8a1d593",
    "date": "2008-01-15T21:42:20.000Z",
    "content": "Your reasearch article talks about UPnP being enabled/disabled in the router which is certainly a facility in my router. I have been concerned about UPnP for some time and I use a utility from www.grc.com that allows me to disable/enable UPnP in my PC. Upto now I have UPnP in the router enabled but disabled in my PC unless I need to use it for a specific purpose. I then use the GRC utility to enable it. I can only use UPnP when both PC and router are enabled.\r\n\r\nIs this a safe way of working or should the router also have UPnP disabled to protect against the possible Flash attack described in your research article?"
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2008-01-15T21:47:14.000Z",
    "content": "Alan, excellent question. The answer is NO. I am not quite sure what this GRC utility does but I suspect that it simply makes UPnP an exception on your local firewall and it turns the Windows SSDP service on. I might be wrong. Turning off/on your machine UPnP capabilities does not solve the problem. The attack will work regardless of that."
  },
  {
    "author": "Conrad",
    "avatar": "9e6cfbca59f3c049aa2fc198a3187bed",
    "date": "2008-01-16T00:01:32.000Z",
    "content": "Can a person write a Flash \"app\" which turns UPn off using UPnP?"
  },
  {
    "author": "An Ogre",
    "avatar": "5a545a6534d11f88ea1a72af73f62924",
    "date": "2008-01-16T01:00:38.000Z",
    "content": "The GRC utility simply stops and disables the Windows UPnP service/driver. Whether that is relevant to this I do not know. Contact Steve Gibson.\r\n\r\nYou are over thinking finding the router. It is well know that nearly all home and SMB routers live at 192.168.1.1 or in the rare instance the default is changed x.x.x.1 relative the machine you are attacking thru.\r\n\r\nThird party, usually Linux based, firmware is likely also vulnerable.\r\n\r\nThis whole thing is rather academic given the vast number of routers running default passwords and settings. Certain ISPs are famous for setting all their routers to one common and weak ID/PW to log in AND leaving remote management enabled.\r\n\r\nYou've also overlooked that there are allot worse things you can make these weak routers do besides steal data from local users. More than a few brands products are running easily altered and even open source code right out of the box that frequently has serious flaws. Few owners ever update router firmware."
  },
  {
    "author": "Kez",
    "avatar": "b334ba1ca311ffabb5bda96fdaff570b",
    "date": "2008-01-16T06:49:22.000Z",
    "content": "The Mole: Well and good, but how on earth is Flash to determine what is a \"private non-public IP address\" and what isn't?  You can't just use the IETF non-routable ranges as an indicator because of both false positives (Eg large corporate intranet on 10.x.x.x with Flash apps that legitimately want to open HTTP connections to intranet servers) and false negatives (ie using an assigned routable range with NAT)."
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2008-01-16T07:36:52.000Z",
    "content": "Conrad, good question. If UPnP exports a methods that allows you to turn UPnP off then it is possible. Though, I haven't seen such a setup."
  },
  {
    "author": "Mele",
    "avatar": "9a0df5b6bafaf63facebf45e7fb28630",
    "date": "2008-01-16T12:10:11.000Z",
    "content": "I have a Linksy router that came with UPnP disabled. I left it that way for about three years. Then last summer, I wanted to try Microsoft's new live FolderShare. Microsoft has a list of routers that will work with FolderShare and explains how to turn UPnP on in each of them. I turned it on and, due to a bug in the Linksy firmware, I found myself locked out of the router interface after I did that. \r\n\r\nEvidently the password is now a random one and the only way to get into the router's interface now is to do a factory reset. That I have been reluctant to do because I use beta firmware (required for one of my most important applications) and would have to go search for that firmware again (it was never on the Linksy FTP server and Linksy will not email it because my router is more than one year old so there is no support). So, I have not fixed the problem. I didn't like FolderShare and haven't needed UPnP on for anything else since I got the router in 2003 so I would simply put the setting for UPnP back to off except I can't get in to do that. \r\n\r\nWhat are all the Microsoft FolderShare folks supposed to do now?"
  },
  {
    "author": "Andy",
    "avatar": "2fa599c05ae9e243f6e0d043cc67ef32",
    "date": "2008-01-16T13:39:41.000Z",
    "content": "Is the attack directed at the ip address of your LAN interface or a multicast address., and if so would changing the default addresses give any protection."
  },
  {
    "author": "TRB",
    "avatar": "edeb598ef797b99ac6a2ec69c458f617",
    "date": "2008-01-16T13:51:56.000Z",
    "content": "How can you tell if your router has been compromised?"
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2008-01-16T14:53:29.000Z",
    "content": "TRB, sometimes it is obvious, sometimes it is not. Some changes performed over UPnP does not reflect into the router administration console."
  },
  {
    "author": "gek",
    "avatar": "b642b4217b34b1e8d3bd915fc65c4452",
    "date": "2008-01-16T15:58:49.000Z",
    "content": "I think this definitly is a vulnerability in flash. Flash does not observe the same origin policy as you write yourself in your article. It's one thing to do simple GET requests, but a complete different thing to be able to craft complete HTTP requests.\r\n\r\nWith XMLHttpRequest you also can't craft a request to a different domain. So why should flash be allowed to do so?"
  },
  {
    "author": "Mark Thornton",
    "avatar": "e3be822fa1f873af6a4f31cc509592e9",
    "date": "2008-01-16T16:51:37.000Z",
    "content": "Unsigned Java applets only allow connections to the site on which they are hosted. Connections to third party sites (such as the router in this case) are not allowed. Flash (or the browser hosting it) should implement similar restrictions."
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2008-01-16T17:00:25.000Z",
    "content": "Mark, keep in mind that Flash does not connect to anything in our case. It simply makes the browser to connect on Flash's behalf. The <code>navigateToURL</code> function will replace the current window where the malicious movie is loaded with the result page of the request. Attackers can hide this change by encapsulating the whole thing within an iframe. However, the <code>sendToURL</code> function also allows you to perform the request but without any visual change, i.e. the state of the malicious movie stays as it is. This, I believe, is a security BUG and needs to be fixed!"
  },
  {
    "author": "miniupnp",
    "avatar": "724d0cd72b982f286977a378ae57b319",
    "date": "2008-01-16T19:38:21.000Z",
    "content": "I have some doubt about all the risks exposed. Only ill written UPnP IGD service software will allow a mapping to a non local IP or change the DNS settings."
  },
  {
    "author": "Aero",
    "avatar": "01332254321e65937b5fcf4a79806d82",
    "date": "2008-01-17T07:27:01.000Z",
    "content": "Once again, run for Cisco when it comes to network devices. They don't support uPNP (except maybe with Linksys brand), so problems like this don't exist."
  },
  {
    "author": "ros palmer",
    "avatar": "07a59e2cfbdd0d3b8a88b5bf486e87e3",
    "date": "2008-01-17T12:00:13.000Z",
    "content": "I have BT home hub and have been warned about the UPnP and would like to know how I get into the hub to turn it off and whether I can customize it as I have read you need it for Skype for example."
  },
  {
    "author": "Frankum",
    "avatar": "8c9a795126a278f2347e3e44b859d7e9",
    "date": "2008-01-18T11:28:13.000Z",
    "content": "The inconvenience of switching off UPNP in the home router depends greatly on how many clients in the home network want to use the the same UPNP application simultaneously.\r\n\r\nThere are lots of home routers which can only handle one instance of the same UPNP application if you use the manual port forwarding method.\r\n(And some manufacturers even suggest to put the client pc or console in the DMZ and that also limits it to just one.) \r\n\r\nSo, with a few kids that have some MSN, some consoles etc, there is not just the burden of doing the manual port forwarding administration once, but you would have to agree to schedule who can play which game or who can MSN etc. at what time and then change the manual port forwarding correspondingly."
  },
  {
    "author": "B.Patten-Walsh",
    "avatar": "a301d119a563f9ee0d7e735a7ca018ad",
    "date": "2008-01-18T21:37:57.000Z",
    "content": "My Draytek Vigor 2500 series has UPnP disabled by default. no problemns with p2p or msn encountered"
  },
  {
    "author": "Andy RSS",
    "avatar": "0bf70e9c4f00b67a5e30e014b5657778",
    "date": "2008-01-19T11:32:16.000Z",
    "content": "Mind me asking - you speak a lot about the threat of and the possibility of - can you give any examples where it's actually happened?\r\n\r\nWhat's the risk on this?  I'm a home user with nothing interesting on my machine (apart from some creative pr0n, but what's the intahwebb without creative pr0n, eh?) and i don't blaze a trail of downloads and blogs and stuff, so i wouldn't consider myself \"visible\" as such - how many cases are you aware of where this has happened?\r\n\r\nI see lots of posts regarding problems with the fix but not one post about problems regarding actually suffering from this exploit - is it common ground that will be splashed about as easily as Sub-7 or B.O. or is it something that would require plenty of skill and knowledge and, therefore, just wouldn't be worth the effort unless the programmer was just broken in the head.\r\n\r\nOn that note, advertisers using flash banners/ads are surely responsible for the content of them ads as they are distributing them, right?\r\n\r\nIt's not our problem guys and unless it starts hitting the net like a plague, whilst i admire your research (the amount of stuff that has gone completely over my head is testament to your dedication and understanding of the situation), this is an exploit that should be addressed by Adobe, should cause concerns for ad-companies and domain providers and we shouldn't have to concern ourselves with it at all, unless we're making ourselves a target for this kind of mal-ware.\r\n\r\nCheers for the info though, top work on that\r\n\r\nA"
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2008-01-19T13:35:23.000Z",
    "content": "Thanks for the comment A,\n\nI see your point. The thing with the Flash UPnP attack is that it is not obvious. This means that even if you get hacked, you won't see it. Some UPnP settings are not visible from the Web Interface, therefore, we cannot provide with a good explanation on how to detect whether you have been hacked.\n\nI am personally not aware of anyone using the attack vector at the moment. But this does not mean that we should not take care of it or even treated it as a serious risk. Maybe, there are already some individual cases but it will take weeks if not months for the real criminals to start taking advantage of it. I wont be surprised if it gets included into MPACK, WebAttacker, or Storm.\n\n<div class=\"message\">Therefore, this type of issue needs to be fixed now, or at least we should make sure that everyone is aware of it so that there are no nasty surprises at the end.</div>"
  },
  {
    "author": "Ros",
    "avatar": "c8f254d699304d077329b3a23242d338",
    "date": "2008-01-22T12:20:24.000Z",
    "content": "I have a Belkin F5D7230-4 wireless router which ships with UPnP disabled, I've never had a problem with Skype or anything else. Thanks for making me aware of the UPnP situation."
  },
  {
    "author": "Th3ChaS3r",
    "avatar": "3cc7312d98dc7a08eea8bc4a1159f4c6",
    "date": "2008-01-22T18:38:10.000Z",
    "content": "This is indeed a very good find, and with me personally owning a HomeHub I am taking this very seriously myself. I am not sure whether a user HAS to visit a website with a script on it. This for me seems like it will work from ANY device connected to the network correct? So if someone connected to an open network is there the possibility that a spoofed message can be sent to the router to do all of these same requests? Just me thinking allowed."
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2008-01-22T21:13:34.000Z",
    "content": "Th3ChaS3r, yes! If you are already inside the network where the UPnP device is located you can just start sending UPnP requests. However, the here presented method is useful when attacking from outside. This is the most important difference."
  },
  {
    "author": "Adam Oellermann",
    "avatar": "564046ba58088a6b5704ef3ace32f1b2",
    "date": "2008-01-26T11:42:49.000Z",
    "content": "I have a cheap Safecom ADSL modem/router (Conexant chipset) which doesn't have UPnP support at all. There must be millions of these boxes in circulation, so I think the \"99% of routers at risk\" statistic is perhaps a bit high. \r\n\r\nOf course, I don't trust little black boxes; I have an IPtables firewall on a Linux box and use dnsmasq on another Linux box for caching DNS - my router is just shifting packets back and forth. Trusting your network security to a closed-source device seems short-sighted to me."
  },
  {
    "author": "wintermute",
    "avatar": "8bf3f779fea74e57d11ee65d7d6454db",
    "date": "2008-01-30T14:45:16.000Z",
    "content": "To me, this attack still seems more of an interesting curiosity than something to be worried about. \r\n\r\nI can see that the Flash UPnP attack works as described, but I can't see how an attacker could leverage it to take over my PC. \r\n\r\nThe scenario where an attacker changes your DNS server is touted as the worst - it lets him force you into visiting his site (e.g. for browser exploit) via the bad DNS. But he must have *already* been able to dupe you into visiting his site in order to view the SWF in the first place! \r\n\r\nAs for adding port forwarding rules - big deal. I can see how it would make me vulnerable e.g. if I was running a file server or something. But most home users (i.e. Windows) won't be running such services themselves, and the out-of-the-box system services (e.g. port 445) will be protected by the host's own firewall (ICF and maybe others).\r\n\r\nI'm happy to be corrected, as always!"
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2008-01-30T16:02:26.000Z",
    "content": "wintermute, if someone changes your DNS they will be able to do a lot more then just forcing to visit a site. They will be able to push down malicious extensions or perform easily the Skype vulnerability that we talked at GNUCITIZEN not that long time ago.\n\nAlso, port forwarding can be quite bad as well. In some cases you can port forward the router's own Web interface in which case you are making it public for attackers. Combine that with the fact that some models allow you to reset the admin credentials through UPnP, then you have a real issue. Opening port forwards to your own machine is interesting but as you said might not be valuable.\n\nExposing your router on the Internet is a big security problem. Changing DNS is also a huge security problem."
  },
  {
    "author": "InvisiBill",
    "avatar": "c98767f9a44d35b72451b4e0a1f0f530",
    "date": "2008-02-03T21:15:04.000Z",
    "content": "@Frankum:\r\nUPnP doesn't do any special port-forwarding that you can't do manually (excluding UI limitations in the client or router).  If you have 5 copies of MSN working with UPnP, then UPnP is having the copy at x.x.x.1 use port 10001, x.x.x.2 use port 10002, x.x.x.3 use port 10003, etc.\r\n\r\nAs long as you can set the router to forward port 10001 to x.x.x.1 and can set the client to listen on port 10001, then it will work just fine when you configure it manually.  You just have to make the router and client match.  Depending on the application though, it may or may not be easy/possible to configure which port it listens on.  I have yet to hear of a router that supports UPnP port-forwarding and not manual port-forwarding (though I'm sure some cheapo model out there touts that as a feature).  Also, the number of ports the app uses will directly relate to the annoying factor - it's not a big deal to forward 1 port for 5 clients, but when each copy wants to use 20 ports it will get really annoying."
  },
  {
    "author": "tinker",
    "avatar": "c43689ce373f4274436d8ca9e7183ee4",
    "date": "2008-06-08T20:16:29.000Z",
    "content": "Any of the folks saying this is not a dangerous vulnerability have no idea what turning your net appliance (router, etc) into a zombie means...\r\n\r\nIf evil.x can control your router, safeguards or info on your system devices (storage, computers, etc)are irrelevant to the biggest danger... your router becomes capable of being an agent in DOS attacks, anonomous-routing of terrorist net traffic, becoming an apparent server for child-porn, any number of which could put YOU in JAIL, with no way of defending yourself, because you left your system available for evil.x to use for their purposes.  If nothing else, you immediately become the suspect in a high level investigation that BEGINS with confiscation of all of your equipment that could have been hooked up to that system(computers, servers, digital cameras...)\r\n\r\n  I just read of one open source developer who works off his laptop, snagged a discarded laptop from the trash, then when rebuilding that drive while connected to his working laptop he found it contained child porn.  His working laptop (not just the drive) was confiscated by the police so forensics could find out if the files had originated from HIS computer, even though he was the one who turn in the complaint...  he was unable to maintain his open-source software for several MONTHS until he could get re-imbursed for his system and get another one.\r\n\r\n   Leaving the router open to flash-uPnP attack is sort of like leaving your keys in your car, with it running, while you go into the bank, which just happens to be held up and then they snag your car for the getaway, running someone over on their way out...  now prove you were not part of that robbery and murder."
  },
  {
    "author": "Gspot",
    "avatar": "b123ef020149bc10c6420d089a0ef14f",
    "date": "2009-01-20T13:56:49.000Z",
    "content": "Unrealized before, this is scary. It's a wide-open hole. \r\n\r\nAlthough a malicious attack will probably not really want to invade a home-user's PC (other than dropping mals/virusi/trojans to create havoc), the hole lets them cover their tracks for whatever other evil they perpetrate on the web.\r\nAkin to handing your Driver's Liscense and Social Security Card to a criminal, asking, \"You're sure you won't use my identity when you commit your crimes?\"\r\n\r\nBut really, the fault is two-fold: \r\n1) UPnP needs to have an authentication. This would solve it.\r\n\r\n2) Adobe needs to seriously investigate their script. Is there a valid need for such a potentially dangerous script?\r\n\r\nThanks for your work!"
  },
  {
    "author": "almafuerte",
    "avatar": "934149c70677fc994544df450c0ccf58",
    "date": "2009-08-23T22:43:43.000Z",
    "content": "This is a double vulnerability. \r\n\r\n1st: People shouldn't install untrusted software. Flash IS an untrusted software. They allow immediate execution of third party unauthorized software and doesn't restrict what they can do, therefore Flash can't be trusted. No web content should be allowed to originate cross-site traffic or originate LAN traffic. I also think, web browsers should disable links to LAN from WAN. That is, a page at 200.10.10.10 shouldn't be able to create a link to 127.0.0.1, or at least the user should be warned about it.\r\n\r\n2nd: Cheap routers are a huge danger. This is just an example. Many exploits have turned up over the years, and it'll only get worse. \r\n\r\nBut, anyway, most people use Windows so this isn't their biggest threat. And most people that doesn't run windows don't use cheap routers and run them with off the box configurations, so, as always, the assholes that shouldn't be using the net get it, so we shouldn't give a fuck."
  },
  {
    "author": "Nic",
    "avatar": "0345bfc404a5e6fa1997a322b49237c8",
    "date": "2009-10-06T00:43:52.000Z",
    "content": "As I understand many router settings can be changed using this exploitive method.  If that's the case, then I would be able to see those changes if I log into my router and check; right?"
  },
  {
    "author": "Simon Helsen",
    "avatar": "c28b6f262a5bef43e77e40c9dcfa6309",
    "date": "2011-03-15T21:56:42.000Z",
    "content": "This site does not look very active, but I can testify that my router was hacked exactly this way. I accidentally noticed it when looking at my traffic meter noticing unusual high bandwidth usage. I was also able to see in the log that outside servers were contacting my log. When doing a whois on some of the IPs I noticed they came from places like Mexico (I am based in Toronto). \r\n\r\nThen looking at upnp, I noticed forwards and then found this website. I just turned it off. Wow. It is freaky to know that my router was abused by someone for who knows what end. \r\n\r\nQuestion: just turning off upnp should un-zoombie my router. Is that right?"
  },
  {
    "author": "roya",
    "avatar": "48be19e1015ae7c29b92aac5a9f56f8f",
    "date": "2011-12-05T22:44:15.000Z",
    "content": "How and in how many ways can i undrestand if my router has compromised or get hacked?"
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2011-12-12T19:56:03.000Z",
    "content": "This is a very good but difficult to answer question. Just check the settings and make sure that there is nothing suspicious. I hope this helps."
  },
  {
    "author": "Omid",
    "avatar": "1bdb9d853761250f7c2c47b9bea5149e",
    "date": "2012-10-09T17:47:56.000Z",
    "content": "Is this attack still prevalent? Any kinda automatic traffic checking (by a software) to find out whether the gateway is under attack?"
  },
  {
    "author": "Anonymous",
    "avatar": "1ef8d82abd32dd6592054ee77aaf5221",
    "date": "2013-02-01T08:13:30.000Z",
    "content": "This is really eye opening. I couldn't ever thought the vulnerability upto this extent. Well, I heard of port security and stuff. But, I didnt know that a utility can redirect ports by default without any user intervention. Though GOOD WORK guys. This is really OUTSTANDING RESEARCH"
  }
]