[
  {
    "author": "Eponymous",
    "avatar": "ae361e550987cfaca8ca4d358d08735e",
    "date": "2007-08-31T21:54:14.000Z",
    "content": "I really like the way he's treating this like an interdisciplinary problem. This problem is at its root is an evolutionary issue of resource acquisition and survival, and then upward it manifests as an individual ethics issue, and then a social problem, and an economic one, and finally as a technical one, similar to the file sharing issue. Moral relativism will always exist and always has. People will do what they feel is acceptable to acquire resources. Western societies view usury as morally sound, others do not. Others view fraud as normal, the west does not. \r\n\r\nTrying to tackle issues like fraud with technology alone is like hiring a dermatologist to do internal medicine. What I think we must do is progress down the stack of motives and consequences, and address the problem at the lowest bottlenecking layer that is feasible and doable. In this case, I think it is the social level. Economic controls like suing Western Union or shutting down e-Gold will only cause replacements to generate at the same tier. \r\n\r\nAs mentioned in the speech, you have to act at the bottlenecks, and the lowest bottleneck is government diplomacy, at the \"social problem\" level. Russia has a social problem in that it expects to do business as a global player, but does not protect the assets or intellectual property of its trading partners. Same with China. We may or may not get around to enforcing certain types of embargos and trade sanctions on governments for their lack of enforcement in protecting western assets, but regardless I see that as the lowest level of feasible bottleneck plugging, because you will never be able to conquer deception in the individual, its as innate to our species as breathing, and as old as prostitution."
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2007-09-02T12:11:14.000Z",
    "content": "Eponymous,\r\n\r\nthanks for your comment. I completely agree."
  }
]