[
  {
    "author": "anonymous",
    "avatar": "ac08a11dabb6e8a4477a4fc96b7399be",
    "date": "2007-10-14T03:21:46.000Z",
    "content": "Re:Citrix \r\nAt least (i hope) they fixed the SQL injection is the CDN login system."
  },
  {
    "author": "LonerVamp",
    "avatar": "1e41c58e98f24908060130e58333e07a",
    "date": "2007-10-15T16:24:59.000Z",
    "content": "I still think there is something amiss. I have no problems with any of your postings except, again, that last paragraph in this one about security in depth.\r\n\r\n\"a system is as secure as the weakest link\"\r\n\r\nThat is correct, but that is also what security in depth is trying to combat, in part. If you have a chain and one link is broken, the whole chain breaks (attacker wins). But if you have a series of chains overlapping each other and providing support when one chain is broken by a weak link, that is security in depth. An attacker has to break through several layers in order to penetrate properly implemented defense in depth.\r\n\r\nDefense in depth helps to:\r\na) cover for inevitable deficiencies in various security layers (protocols, systems, devices, software, web apps...)\r\nb) cover for human mistake\r\nc) attempt to anticipate unexpected attacks from skilled, creative attackers\r\nd) raises the bar for attacker knowledge; an attacker may have a few key skills, but proper defense in depth may mean the attacker can only break through a couple security measures, but can't quite own everything else. Hopefully it takes enough time that they get found out or holes are closed.\r\ne) mitigates successful attacks\r\n\r\nSome of your attacks are successful and scary because defense in depth is not being properly practiced. Then again, it is hard to defend in depth when we're not even sure where the next attack will come from. User George runs a personal firewall, router/firewall on the network, AV, changes passwords...and then you pop him with a bad script that asks his credentials from a web page? That's simply a chink in the armor, a hole in the defense in depth.\r\n\r\nBut if my web server has a vulnerable web app and you pop into it, but my web server runs jailed, did you own my system? Not yet, perhaps. That's defense in depth.\r\n\r\nNow, I think you can form some points on two things:\r\n1) Defense in depth adds complexity. Man, does it! But until perfect security comes around (and I posit that it never will, especially as long as humans are involved), the added complexity needs to be weighed against the defense gained.\r\n\r\n2) Defense in depth isn't being practiced in large scale because it isn't economical. This might be an interesting research idea to poll large scale IT security teams and see if they utilize defense in depth concepts.\r\n\r\nI suspect most large companies do a combination...a sort of partial defense in depth strategy that still has plenty of holes and weaknesses. But does that make is useless and broken? That's an interesting question...\r\n\r\nAn additional attack on the concept might come from how defense in depth masks the holes in each layer. If you have a mesh of chains all holding your organization's security in place, if one breaks, you might not notice the break because nothing came crashing down. This is a danger with defense in depth, and could be a point against the concept.\r\n\r\nI don't mean to pounce on this one issue, but I think it takes away from your recent excellent posts and revelations.\r\n\r\nJust like attacks make our networks stronger, proper discussion and challenges make our ideas and goals stronger. :) Keep up the good work, pdp and others at gnucitizen."
  },
  {
    "author": "Rogers",
    "avatar": "f8e89ac87f640d2eb16c52d2714795f6",
    "date": "2007-10-19T10:28:57.000Z",
    "content": "Regarding the ICA/RDP-issued. Are servers generally set up to allow users to donwload and execute any random file to/on the ICA/RDP-server? I guess this would be a great flaw in itself. If this is allowed, any user can bring down the server by downloading malware. I thought the point was to only allow users to execute installed applications that are white-listed by the admins."
  }
]