[
  {
    "author": "will",
    "avatar": "323abb8ce5ee73fa79211152842de4a5",
    "date": "2006-12-15T22:06:41.000Z",
    "content": "Have you tried this in IE 7 yet?  I can't get it to work."
  },
  {
    "author": "Adriaan Graas",
    "avatar": "650b19345a595cebcbae70e414aa48ab",
    "date": "2006-12-16T01:50:54.000Z",
    "content": "Hi,\r\n\r\nI am following your blog for a little wile now, and I think it is really great that you point out so much issues.\r\n\r\nIn this post you say that these are not browser vulnerabilities, but server side problems. I don't really get that.\r\n\r\nExtensions don't matter. So the browser looks to the content-type header what it is. When it says its html, does that mean that it should handle it as html? A image is most likely embedded in html or css. The browser should know by then (by tag or css) that it should handle it as image, and then ignore the header. It would be more clean if the browser takes the websites source as first priority how to interprent the file, instead of just accepting the header, imho. This would solve a lot of security issues.\r\nImages which are not included by website source should then be handled as the content-type header says.\r\n\r\nI hope you understand my english, and please correct me if I'm wrong.\r\n\r\nAdriaan"
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2006-12-17T09:19:39.000Z",
    "content": "Will, it works on IE7 SP2. I have tested it on my machine. Make sure that you put the files on a server first. Download WAMP and start from there.\r\n\r\nAdriaan, your English is good. I understand what you are talking about and I am on your side. Sure, browser can do some additional checks to verify that what it is receiving is what it says. Unfortunately, I can clearly see that this is not the case and it never be.\r\n\r\nThe problem here is that the Internet/Web is almost infinite. There are so many different file types out there that it takes a big afford just to put them into a database. Browsers, should take this a lot more seriously, sure, but is it feasible. I don't know. Maybe they should be able to check for the most popular file types such as JPG, PNG, JS, CSS, GIF... etc. However, I can see how in certain situation this feature can break one or another company corporate application. So, from all browsers out there, only Firefox, Opera and a few others may implement this feature in the near future. I hope they do. IE will support all legacy stuff no matter what.\r\n\r\nYou are bringing some interesting points here. Let's see if browser vendors will take your advice seriously."
  },
  {
    "author": "kuza55",
    "avatar": "2f6303f9095f59c14c3097ef4df566f5",
    "date": "2006-12-17T12:03:44.000Z",
    "content": "Well, I'm pretty sure most people developing serious applications nowadays know about this issue. And so most applications at least check the headers of the files to make sure that they are the appropriate headers. Some like vBulletin go further and do a limited scan on the first part (200 bytes in vBulletin's case) of the image to make sure that anyone using an old version cannot be attacked. (The odd thing about vBulletin though is that the patch is actually rather recent, which makes you wonder about why it has suddenly become something they wanted to guard against)\r\n\r\nMySpace goes further and makes sure that it is a valid image and can be rendered. I'm not sure how it does it, but one of the possibilities I've thought of would be using something like the GD library to detect what type of picture it is then try and load it and if it fails then don't move it to a web-accessible directory, and simply remove it.\r\n\r\nSo barring a vulnerability similar to the IE GIF one mentioned in this post I don't think there are going to be any similar issues."
  },
  {
    "author": "harmlessHacked",
    "avatar": "51fdd11bdf73069263fafb972c5a5d1d",
    "date": "2006-12-18T10:17:19.000Z",
    "content": "Also attacker my use servlet not only to display image but also hijak the session id of the user, by giving extension of gif or jpeg or other image extension to the servlet name  like myavatar.jpeg which performs both tasks; display image and hijak sessionID"
  },
  {
    "author": "pst",
    "avatar": "207dbe010bfee5cccaa768c938ab4afa",
    "date": "2006-12-18T11:06:55.000Z",
    "content": "Hi,\r\n\r\nInteresting discussion indeed. Content checking is an ever coming up issue, and I think that browser vendors/creators should care. However it's not on the file type recognition part but on the processing part where the stake lies. If a file has a .jpg ending it should be handled as JPEG and not be parsed as HTML (as in our above example), that's all about sticking witzh standards. \r\n\r\nIt's the same (many years now) with bad HTML code. Why should a browser interpret bad/non standard HTML code ? The result can be unexpected even not speaking about the security issue it implicates.\r\n\r\njust my 5 cents,\r\npst"
  },
  {
    "author": "harmlessHacked",
    "avatar": "51fdd11bdf73069263fafb972c5a5d1d",
    "date": "2006-12-19T14:31:02.000Z",
    "content": "I'm almost sure that embed both image and id theft in a servlet can't bypassed since the http header may be altered before posting response, even if browser sanitize the image and find it innocent he will never ever detect the id theft because it a server-side stuff"
  },
  {
    "author": "Danny",
    "avatar": "6523b6effa7af8025cbdf9c6dd0d70e6",
    "date": "2006-12-22T00:46:20.000Z",
    "content": "I just attempted this on my MySpace and it didn't allow me to upload it. I also tried on facebook and that did not work either. Check this site, I'm sure with not too much imagination you could derive a very slick exploit from this idea and the one on this site.\r\n\r\n\thttp://jeremiahgrossman.blogspot.com/2006/12/i-know-if-youre-logged-in-anywhere.html"
  },
  {
    "author": "harmlessHacked",
    "avatar": "51fdd11bdf73069263fafb972c5a5d1d",
    "date": "2006-12-23T11:21:53.000Z",
    "content": "An URL not an Image:\r\nTo perform this trick you should be able to feed an url to the \"spy\" image which is hosted in a server of yours, so you have to feed an URL to the image not upload the image itself (actualy the servlet). in another word Myspace is expected to save the URL in its database not the image itself."
  },
  {
    "author": "Dan",
    "avatar": "ed7d2fcd70d74c15dbccb08a59add64e",
    "date": "2007-02-09T00:20:27.000Z",
    "content": "This doesnt work on myspace."
  },
  {
    "author": "uropian",
    "avatar": "e13f61dc690051b781526697ddc78d31",
    "date": "2007-05-05T00:38:59.000Z",
    "content": "Nor can Mehtap! I want to say that your site better throughout the World Wide Web :) \r\nThank you. Keep it."
  },
  {
    "author": "andrew",
    "avatar": "d390e79dd8a5e0f81c160000ba23ddfa",
    "date": "2008-03-25T11:20:37.000Z",
    "content": "\"In fact, this is not even a browser related problem. It is a server side problem\"\r\n\r\nI don't agree. If server sends header:\r\n\r\nContent-Type: image/jpeg\r\n\r\nthen IE (as any other browser) should render the image as an image, not parse it as HTML! \r\n\r\nThis is a huge bug on IE side, and while the server can remedy things by carefully examining the images, that really should not be needed. This is clearly another IE bug."
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2008-03-25T13:08:25.000Z",
    "content": "andrew, in a way it is a server-side problem because developers allow uploads of files based on their extensions. IE shouldn't try to detect the mime-type of everything it pulls from the web but also developers should sanitize everything that comes from the user in order to prevent the wrong data going into the wrong pace."
  },
  {
    "author": "andrew",
    "avatar": "d390e79dd8a5e0f81c160000ba23ddfa",
    "date": "2008-03-25T14:26:17.000Z",
    "content": "pdp, I disagree - mime types and headers are there to ensure correct handling of the data sent. It is the way things should work and IE clearly violates that. Without this IE bug there would be no security problem at all. \r\n\r\nAlso, web developers should not care if the images are valid (and even valid images can contain JS!), at least not from security point of view. They should take care that they are served the right way (and not executed on the server), that they are small enough, that they have correct extension and mime type header - but that's all. \r\n\r\nI think IE is to blame, but yes, web developers must deal with it... :("
  }
]