[
  {
    "author": "raven",
    "avatar": "dbc9fe4f18aab307d580ef292b294426",
    "date": "2010-02-24T22:10:15.000Z",
    "content": "What an awesome and innovative discovery method."
  },
  {
    "author": "packet_viper",
    "avatar": "c59b1fbcf86370469862f4961d07b275",
    "date": "2010-02-25T23:08:25.000Z",
    "content": "Now seeing that I have found several of these that have no password, isn't it possible to upload another piece of firmware and use this as an access point into a business or homes network? You know like DMS linux or a usb version of backtrack to continue an attack from there.  This is coming from a Pen-Tester and I am just curious at this point seeing as to how my brain is just running @ 1k a minute."
  },
  {
    "author": "pagvac",
    "avatar": "0367b81839d31a5fa3d7bea79ef71b9e",
    "date": "2010-02-26T21:12:41.000Z",
    "content": "@packet_viper: the camera's firmware is open source and available on the linksys site. so in theory you could modify the firmware and upload your own customized version."
  },
  {
    "author": "what",
    "avatar": "29debdfb33457d4ff7a01be81c94af89",
    "date": "2010-02-26T23:56:15.000Z",
    "content": "I've written a simple Perl script that uses an HTTP method to accomplish the same thing a while back. It's very interesting to see someone else go at these cameras. I found a few in people's living rooms, and with IE/ActiveX, you can hear sound. Very creepy, and I am sure this breaks wiretapping laws, so I will say I did it for educational purposes only and not to monitor anyone."
  },
  {
    "author": "Paul",
    "avatar": "40fb2a4f6c88ac008a80b3ab235167c3",
    "date": "2010-03-08T18:51:27.000Z",
    "content": "Anyone could tell me where I could find source code for WVC54GCA v 1.1, I really can't find it anywhere.\r\n\r\nThanks !"
  },
  {
    "author": "Longpoke",
    "avatar": "93ce59ea9096936b695d975bf4096e53",
    "date": "2010-04-28T05:47:41.000Z",
    "content": "If there is an upload firmware button you can upload firmware. As long as there is no digital signature (that's properly validated) you can upload your own modified firmware."
  },
  {
    "author": "L0RE",
    "avatar": "27e52d3e4e67cd0afc696d5680872aee",
    "date": "2010-10-12T07:37:14.000Z",
    "content": "Hi,\n\nI like Linux , I like it more open. If you would like to try http://rapidshare.com/files/424551784/WVC54GCA.bin No Warranty, you are self responsible for any Action.... usw.... Its now 1.1.01 Firmware  with Telnet enabled root password is toor for this firmware any comments are Welcome"
  }
]