[
  {
    "author": "Ross Snider",
    "avatar": "bd53983161441595a6c36a6ba42998c4",
    "date": "2008-07-17T14:22:20.000Z",
    "content": "Keep in mind his saying, \"If it recurses, it is vulnerable\". The authoritative name servers are not at risk, while recursive name servers are. He has suggested a few times that you disable recursion if you do not use it.\r\n\r\nI personally believe this is the key."
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2008-07-17T15:02:22.000Z",
    "content": "recursion is the fancier way of saying that the DNS server turns into a DNS client, i.e. the same thing. The DNS server makes a request to an authoritative servers, which in tern proposes a response after recursing itself.\r\n\r\nthis means that Dan spoofs responses for the first or any other DNS server of the recursive chain. I suspect that he might do something like a mass spoof for each ns server of the chain, thus increasing the chances of getting the right transaction ID.\r\n\r\n<q>My take is that Dan is simply blasting all the name servers in the recursive chain until one of them has a transaction ID that matches any of his requests. I suspect, although I haven't tried, this is very much doable.</q>"
  },
  {
    "author": "Ross Snider",
    "avatar": "bd53983161441595a6c36a6ba42998c4",
    "date": "2008-07-17T15:47:59.000Z",
    "content": "I'm not sure that this is it PDP. There are 16 bits of randomness. It is true that mass spoofing for each nameserver seems like it would increase the probability of a successful cache poison, however mail.victimsite.com doesn't seem like it has enough recursion there to trivialize the DNS cache spoofing. He made a very big deal on how trivial it is to successfully poison a nameserver.\r\n\r\nIf he had the resources to mass spoof 3 nameservers X amount couldn't he mass spoof 1 nameserver 3X amount (disregarding packet loss).\r\n\r\nIt doesn't seem that advantageous. Now, I have little experience with DNS, so I may be wrong; there are not that many nameservers in each recursive chain to make the whole system fundamentally flawed. I believe Dan is leveraging this in some other way.\r\n\r\nWhat do you think, PDP?"
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2008-07-17T15:57:05.000Z",
    "content": "Hei Ross,\r\n\r\nI was politely asked by Dan to discontinue this conversation and I respect that. I suspect that it is not because my thoughts are any closer to the real thing but mainly because he doesn't want to cause too much chaos. So we will wait until BH and will see what is going to happen.\r\n\r\ncheers"
  },
  {
    "author": "rvdh",
    "avatar": "fcab05a2d8d8ca0d32e66d0cbd22269e",
    "date": "2008-07-17T18:53:31.000Z",
    "content": "How about reusing source ports, how about reusing all ports. \r\n\r\nBut, fact is DNS is insecure by design. Doesn't mean I am interested in the actual release of details though."
  },
  {
    "author": "yanky",
    "avatar": "ea587041996e2a968c151cadd6c37532",
    "date": "2008-07-19T18:35:44.000Z",
    "content": "1. \"There is a serious flaw in the DNS system and apparently it is a design bug\".\r\n\r\nNo really, quote from the RFC: \"This document recommends the use of UDP source port number randomization to extend the effective DNS transaction ID beyond the available 16 bits.\"\r\n\r\nBut DNS applications developers didn't respect that. That's where the vulnerability is.\r\n\r\n2. \"It has something to do with sending fake/forged responses to the attacked namerserver \"\r\n\r\nNo, the attacker must know the DNS server in order to change the source address of the malicious packet. The packet is sent to the victim.\r\n\r\n3. \"The attacker must know in advance or can predict the transaction ID\"\r\n\r\nYep, we got 2^16-1 possibilities, but in fact the transaction ID is incremented by 1 for each new request. So if we know a TID sent by the victim, this can be done easily.\r\n\r\n4. \"It is probably something that can happen but it may not work well for high profile domains such as google.com\"\r\n\r\nWhy not ? The cache is deleted for each reboot on XP.\r\n\r\n5. \"The attack is remote so we can eliminate man-in-the-middle attacks.\"\r\n\r\nWhat if I redirect a domain to my own ip address ? And for each request sent to me, I sent a request to the true domain, then I show the response to the victim. Acting like a proxy.\r\n\r\n6. The vuln was found many years ago and published, but no one cared about it. The solution reduce the probability ... but what if I have a lot of computer.\r\n\r\n7. Journalists said something like \"OMFG they can hack us !\" ... Oh excuse me, but, is there anything new here ? :)"
  },
  {
    "author": "yanky",
    "avatar": "ea587041996e2a968c151cadd6c37532",
    "date": "2008-07-19T20:05:07.000Z",
    "content": "Oops sorry, Concerning 2 that's not what I wanted to say, you're right for this point ;)"
  },
  {
    "author": "pdp",
    "avatar": "c4db4e65c9f09f2a373fcaefa5e2bfb4",
    "date": "2008-07-21T10:25:32.000Z",
    "content": "Dan says that this is a very much practical attack and brute forcing the transaction IDs is not practical at all unless you are within an environment you can control like a LAN.\r\n\r\nyanky, I do not understand most of your points. :) sorry mate."
  },
  {
    "author": "IDE",
    "avatar": "2446929d0e322c1d9ddece44bba78b33",
    "date": "2008-07-22T11:31:38.000Z",
    "content": "Here is the solution: http://amd.co.at/dns.htm\r\n\r\nThat is very interesting and I have studied this."
  },
  {
    "author": "ducnm",
    "avatar": "50cfc4507190f388a42601557905c7b1",
    "date": "2008-07-26T09:34:45.000Z",
    "content": "On 07/25/2008, Bkis, has released BkavDNSCheck, new software checking for Dan Kaminsky DNS flaw. \r\n\r\nThe advantage of this software is that BkavDNSCheck could solve the limitation of Dan's Tool (http://www.doxpara.com). BkavDNSCheck is able to test exactly the specific DNS Server which we want to check, while Dan's Tool could only test the last top DNS server (not owned by the checker - DNS administrator).\r\n\r\nTogether with launching the software, Bkis has published some articles on how to apply patch against this flaw for vulnerable systems, thus keeping DNS systems away from a hazardous large-scale attack. These may help ISPs to check their DNS systems. We also provide the article of the tool to local press in order to guide administrators to check and patch their systems.\r\n\r\nPlease, read the following: http://security.bkis.vn/?p=75 for reference.\r\n\r\nIf you find it's usefull, please provide it to whom may concern\r\n\r\nThank you and best regards"
  }
]